{
  "name": "Beijing",
  "title": "Beijing - Traveling China like your home yard",
  "heroTitle": "Beijing",
  "heroSubtitle": "The Heart of China",
  "heroImage": "../images/user_photos/beijing_hero_bg.jpg",
  "overview": "Beijing, the capital of the People's Republic of China, stands as one of humanity's greatest urban achievements—a city where over 3,000 years of history coexists with cutting-edge modernity. As the political, cultural, and educational center of the world's most populous nation, Beijing has served as the capital for the Yuan, Ming, and Qing dynasties, as well as the current republic, giving it a depth of historical significance matched by few cities on Earth. With a population exceeding 21 million, this megacity sprawls across the North China Plain, anchored by the monumental Forbidden City at its heart and ringed by the Great Wall, which snakes across the mountains to the north. The city's urban fabric tells the story of China's journey through time. The historic core, with its north-south axis aligned according to ancient cosmological principles, contains the world's largest palace complex in the Forbidden City, along with the Temple of Heaven where emperors prayed for bountiful harvests. The hutongs—narrow alleyways lined with traditional courtyard houses—offer intimate glimpses into old Beijing life, where residents still live much as they have for centuries. Yet just beyond these ancient neighborhoods rise architectural marvels of the 21st century: the CCTV Headquarters, nicknamed 'Big Pants' for its distinctive shape; the National Stadium, known as the 'Bird's Nest'; and the vast network of modern infrastructure that supports one of the world's most dynamic economies. Beijing's cultural offerings are equally impressive, with over 150 museums, numerous UNESCO World Heritage Sites, and a thriving contemporary arts scene centered in the 798 Art District. The city is home to China's most prestigious universities, including Peking University and Tsinghua University, which have produced generations of China's leaders and intellectuals. The culinary landscape spans from imperial court cuisine to street food delicacies like Beijing duck, jianbing, and zhajiangmian. Whether you're watching the sunrise over Tiananmen Square, hiking an unrestored section of the Great Wall, or exploring the hip cafes of Sanlitun, Beijing offers an endless array of experiences that capture the essence of China's past, present, and future.",
  "highlights": {
    "attractions": "Great Wall of China, Forbidden City, Temple of Heaven, Summer Palace, Tiananmen Square",
    "cuisine": "Peking Duck, Jianbing, Zhajiangmian, Mongolian Hot Pot, Beijing Yogurt",
    "bestTime": "Autumn (September-October) with clear skies and pleasant temperatures"
  },
  "cuisine": {
    "signature_dishes": [
      {
        "name": "Peking Duck (北京烤鸭)",
        "description": "Crispy skin duck served with thin pancakes, hoisin sauce, and scallions"
      },
      {
        "name": "Zhajiangmian (炸酱面)",
        "description": "Noodles with fermented soybean paste, vegetables, and minced pork"
      },
      {
        "name": "Jianbing (煎饼)",
        "description": "Crispy breakfast crepe with egg, cilantro, and crunchy cracker"
      },
      {
        "name": "Chuan'r (串儿)",
        "description": "Grilled lamb skewers with cumin and chili"
      },
      {
        "name": "Baozi (包子)",
        "description": "Steamed buns filled with pork, vegetables, or sweet bean paste"
      }
    ],
    "street_food": [
      "Jianbing",
      "Chuan'r",
      "Tanghulu",
      "Douzhi",
      "Lǘdagun"
    ],
    "famous_restaurants": [
      "Quanjude",
      "Bianyifang",
      "Huguosi Snack Bar"
    ],
    "dishes": [
      {
        "name": "Peking Duck",
        "description": "World-famous roasted duck with crispy skin, served with pancakes, scallions, and sweet bean sauce."
      },
      {
        "name": "Jianbing",
        "description": "Savory Chinese crepe with egg, crispy wonton, and various fillings - a popular breakfast item."
      },
      {
        "name": "Zhajiangmian",
        "description": "Hand-pulled noodles topped with fermented bean sauce, minced pork, and fresh vegetables."
      }
    ],
    "foodStreets": [
      {
        "name": "Gui Street (Ghost Street)",
        "description": "Famous late-night food street with red lanterns, known for spicy crayfish and hotpot."
      },
      {
        "name": "Niujie Muslim Quarter",
        "description": "Authentic halal cuisine including lamb skewers, beef noodles, and traditional pastries."
      }
    ],
    "food_icon": "https://kimi-web-img.moonshot.cn/img/media.istockphoto.com/f85a35c490a0365984f5cae797a7b97baf1c12d9.jpg"
  },
  "transportation": {
    "gettingThere": [
      "By Air: Beijing Capital International Airport (PEK) and Beijing Daxing International Airport (PKX)",
      "By Train: High-speed rail connects Beijing to Shanghai, Xi'an, Guangzhou, and other major cities",
      "By Bus: Long-distance bus services from neighboring provinces and cities"
    ],
    "gettingAround": [
      "Subway: Extensive metro system covering all major attractions and districts",
      "Bus: Comprehensive public bus network with air-conditioned vehicles",
      "Taxi/Didi: Readily available, affordable for short distances",
      "Bike-sharing: Convenient for exploring hutongs and parks"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Imperial Heritage",
      "activities": [
        "Morning: Visit Tiananmen Square and Forbidden City (allow 3-4 hours)",
        "Afternoon: Explore Jingshan Park for panoramic city views",
        "Evening: Traditional Peking Duck dinner at Quanjude or Dadong"
      ]
    },
    {
      "day": "Day 2: Great Wall Adventure",
      "activities": [
        "Morning: Hike Mutianyu section of Great Wall (less crowded, scenic)",
        "Afternoon: Visit Temple of Heaven, UNESCO World Heritage site",
        "Evening: Wangfujing pedestrian street for shopping and snacks"
      ]
    },
    {
      "day": "Day 3: Culture & Nature",
      "activities": [
        "Morning: Summer Palace with beautiful gardens and Kunming Lake",
        "Afternoon: Hutong rickshaw tour to experience traditional courtyard life",
        "Evening: Beijing Opera or acrobatics show"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/beijing_1.jpg",
    "../images/user_photos/beijing_2.jpg",
    "../images/user_photos/beijing_3.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "BEIJING INSTITUTE OF TECHNOLOGY"
    },
    {
      "number": "CN116453211A",
      "title": "Autonomous driving perception system based on multi-modal fusion",
      "assignee": "BAIDU ONLINE NETWORK TECHNOLOGY (BEIJING) CO., LTD."
    },
    {
      "number": "CN115892156A",
      "title": "Method and apparatus for natural language processing using transformer architecture",
      "assignee": "BEIJING BYTEDANCE NETWORK TECHNOLOGY CO., LTD."
    },
    {
      "number": "CN116322434A",
      "title": "Sichuan-Chongqing regional multi-energy complementary optimal scheduling method",
      "assignee": "STATE GRID BEIJING ELECTRIC POWER COMPANY"
    },
    {
      "number": "CN116789012A",
      "title": "Foldable display device with improved hinge mechanism",
      "assignee": "BEIJING XIAOMI MOBILE SOFTWARE CO., LTD."
    },
    {
      "number": "CN115678901A",
      "title": "Cloud-based distributed storage system with enhanced data security",
      "assignee": "BEIJING KINGSOFT OFFICE SOFTWARE CO., LTD."
    },
    {
      "number": "CN117123456A",
      "title": "5G base station antenna array with beamforming optimization",
      "assignee": "BEIJING HUAWEI DIGITAL TECHNOLOGY CO., LTD."
    },
    {
      "number": "CN116890123A",
      "title": "Quantum computing error correction method and system",
      "assignee": "BEIJING ACADEMY OF QUANTUM INFORMATION SCIENCES"
    },
    {
      "number": "CN115456789A",
      "title": "Smart city traffic management system using AI prediction",
      "assignee": "BEIJING SENSETIME TECHNOLOGY DEVELOPMENT CO., LTD."
    },
    {
      "number": "CN117567890A",
      "title": "Carbon capture and storage method for industrial applications",
      "assignee": "BEIJING SINOPEC RESEARCH INSTITUTE OF PETROLEUM PROCESSING"
    }
  ]
}