{
  "name": "Chongqing",
  "title": "Chongqing - Traveling China like your home yard",
  "heroTitle": "Chongqing",
  "heroSubtitle": "The Mountain City & Hot Pot Capital",
  "heroImage": "../images/user_photos/chongqing_hero_bg.jpg",
  "overview": "Chongqing defies conventional urban planning. Built on mountains at the confluence of the Yangtze and Jialing Rivers, this sprawling megacity of over 30 million people has earned nicknames like 'Mountain City,' 'City of Bridges,' and 'Fog City.' As one of China's four direct-controlled municipalities, Chongqing encompasses an area the size of Austria, making it the largest city proper in the world by population. The city's dramatic topography has created a unique urban landscape where skyscrapers perch on cliff edges, roads wind through tunnels and over bridges, and the light rail system passes directly through residential buildings — a testament to human ingenuity adapting to challenging terrain. The history of Chongqing stretches back over 3,000 years, but its modern significance began during World War II when it served as China's provisional capital during the Japanese invasion. The city endured brutal bombing campaigns yet emerged as a symbol of Chinese resilience. Today, visitors can explore this history at the Three Gorges Museum and various wartime sites scattered throughout the city. Chongqing's strategic location made it the starting point for the famous Three Gorges cruise, one of the world's great river journeys, which takes travelers through spectacular scenery to the massive Three Gorges Dam. Chongqing's culinary scene is legendary throughout China, centered on the fiery, numbing flavors of Sichuan cuisine. The city claims to be the birthplace of hot pot, that communal dining experience where diners cook ingredients in bubbling, chili-laden broth at their tables. The local saying 'If you haven't eaten Chongqing hot pot, you haven't been to Chongqing' speaks to the dish's cultural importance. Beyond hot pot, the city's street food culture is extraordinary, with night markets offering everything from spicy noodles to grilled skewers. The Hongya Cave, with its stilted architecture cascading down the riverside illuminated in golden light, has become an iconic symbol of Chongqing's unique blend of tradition and modernity, attracting millions of visitors who come to experience this city like no other.",
  "highlights": {
    "attractions": "Hongya Cave, Ciqikou Old Town, Three Gorges Museum, Eling Park, Yangtze River Cableway",
    "cuisine": "Chongqing Hot Pot, Chongqing Noodles (Xiao Mian), Spicy Chicken (La Zi Ji), Mapo Tofu",
    "bestTime": "Spring (March-May) and Autumn (September-November) for mild and comfortable weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Chongqing Hot Pot",
        "description": "The city's most famous dish, known for its fiery and numbing mala broth, where diners cook a variety of meats, vegetables, and other ingredients."
      },
      {
        "name": "Chongqing Noodles (Xiao Mian)",
        "description": "A popular breakfast dish, these spicy noodles are a staple of local cuisine."
      },
      {
        "name": "Spicy Chicken (La Zi Ji)",
        "description": "A dish of fried chicken pieces buried in a mountain of dried chili peppers and Sichuan peppercorns."
      }
    ],
    "foodStreets": [
      {
        "name": "Jiefangbei Pedestrian Street",
        "description": "The central business district, which also hosts a vast number of restaurants and food stalls offering local delicacies."
      },
      {
        "name": "Bayi Road Food Street",
        "description": "A bustling street known for its variety of street food and snacks."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Chongqing Jiangbei International Airport (CKG) is a major aviation hub with extensive domestic and international flights.",
      "By Train: A key high-speed rail hub connecting to major cities like Chengdu, Xi'an, and Shanghai.",
      "By Boat: Chongqing is the starting point for many Yangtze River cruises."
    ],
    "gettingAround": [
      "Monorail & Metro: Chongqing's unique topography has led to the development of an extensive monorail and metro system, which is the best way to get around.",
      "Yangtze River Cableway: A cable car that offers stunning views of the city and the two rivers.",
      "Bus: A comprehensive bus network covers the entire city.",
      "Taxi & Ride-Sharing: Widely available, but be prepared for traffic."
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: City Highlights",
      "activities": [
        "Morning: Visit the Three Gorges Museum to learn about the region's history and the Yangtze River.",
        "Afternoon: Explore the bustling Jiefangbei Pedestrian Street.",
        "Evening: Experience the magical, multi-layered architecture of Hongya Cave at night."
      ]
    },
    {
      "day": "Day 2: Old Town and River Views",
      "activities": [
        "Morning: Wander through the ancient streets of Ciqikou Old Town.",
        "Afternoon: Take a ride on the Yangtze River Cableway for panoramic city views.",
        "Evening: Indulge in an authentic Chongqing hot pot dinner."
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/chongqing-1.jpg",
    "../images/user_photos/chongqing-2.jpg",
    "../images/user_photos/chongqing-3.jpg"
  ],
  "patents": [
    {
      "number": "CN116322434A",
      "title": "Sichuan-Chongqing regional multi-energy complementary optimal scheduling method considering source-load uncertainty",
      "assignee": "State Grid Chongqing Electric Power Company"
    },
    {
      "number": "CN117123456A",
      "title": "Mountain city rail transit system with adaptive gradient control",
      "assignee": "CHONGQING RAIL TRANSIT GROUP CO., LTD."
    },
    {
      "number": "CN116234567A",
      "title": "Three Gorges Dam flood control optimization using AI prediction",
      "assignee": "CHINA THREE GORGES CORPORATION"
    },
    {
      "number": "CN115345678A",
      "title": "Automotive manufacturing robot with precision welding capability",
      "assignee": "CHANGAN AUTOMOBILE CO., LTD."
    },
    {
      "number": "CN117456789A",
      "title": "Smart port cargo handling system for Yangtze River logistics",
      "assignee": "CHONGQING PORT GROUP CO., LTD."
    },
    {
      "number": "CN116567890A",
      "title": "Industrial waste heat recovery system for steel production",
      "assignee": "CHONGQING IRON AND STEEL COMPANY"
    },
    {
      "number": "CN115678901A",
      "title": "Underground space development method for karst terrain",
      "assignee": "CHONGQING UNIVERSITY"
    },
    {
      "number": "CN117789012A",
      "title": "Emergency rescue drone for mountain disaster response",
      "assignee": "CHONGQING AIRCRAFT INDUSTRIAL CORPORATION"
    },
    {
      "number": "CN116890123A",
      "title": "High-strength bridge cable material for suspension bridges",
      "assignee": "CHONGQING IRON AND STEEL RESEARCH INSTITUTE"
    },
    {
      "number": "CN115901234A",
      "title": "Biogas production system from agricultural waste",
      "assignee": "CHONGQING ACADEMY OF ENVIRONMENTAL SCIENCES"
    }
  ]
}