{
  "name": "Dali",
  "title": "Dali - Traveling China like your home yard",
  "heroTitle": "Dali",
  "heroSubtitle": "Historic City in Yunnan Province",
  "heroImage": "../images/user_photos/dali_hero_bg.jpg",
  "overview": "Dali, nestled in the western reaches of Yunnan Province, presents one of China's most idyllic landscapes, where the crystal-clear waters of Erhai Lake meet the imposing Cangshan Mountains. This ancient city, which served as the capital of the Nanzhao and Dali Kingdoms from the 8th to 13th centuries, carries a legacy of over a thousand years of continuous habitation. The city's unique location on a narrow strip of land between the 40-kilometer-long lake and the 19-peak mountain range creates a dramatic natural setting that has inspired poets, painters, and travelers for generations. The heart of Dali is its ancient town, a walled settlement that preserves the traditional architecture of the Bai ethnic minority. Unlike many tourist-oriented ancient towns in China, Dali's old city maintains an authentic, lived-in atmosphere where locals continue their daily routines alongside the cafes, guesthouses, and artisan shops that cater to visitors. The Bai people, known for their distinctive white-washed walls, upturned eaves, and intricate woodcarvings, have created a built environment that harmonizes perfectly with the natural surroundings. The iconic Three Pagodas of Chongsheng Temple, standing for over a millennium, serve as silent sentinels watching over the valley. Beyond the ancient town, Dali offers a lifestyle that has made it a magnet for Chinese and international expatriates seeking an alternative to urban pressures. The mild climate, with temperatures rarely exceeding 30°C even in summer, supports a year-round growing season that fills local markets with fresh produce. Cycling around Erhai Lake has become a rite of passage for visitors, passing through fishing villages, wetlands, and farmland where traditional methods persist. The Dali lifestyle emphasizes slow living, artistic expression, and connection with nature—values increasingly rare in modern China. Whether you're exploring the marble workshops that give Dali its name ('da' meaning marble), sampling Bai minority cuisine, or simply watching the clouds roll over Cangshan Mountain, Dali offers a glimpse into a more measured, beautiful way of life.",
  "highlights": {
    "attractions": "Dali Ancient Town, Three Pagodas, Erhai Lake, Cangshan Mountains",
    "cuisine": "Rushan Cheese, Xizhou Baba, Dali-style Hot Pot, Erhai Lake Fish",
    "bestTime": "Spring (March-May) and Autumn (September-November) with pleasant weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Rushan Cheese",
        "description": "Traditional Bai ethnic minority cheese, often grilled and served with honey."
      },
      {
        "name": "Xizhou Baba",
        "description": "Local flatbread specialty from Xizhou Town, crispy and flavorful."
      },
      {
        "name": "Erhai Lake Fish",
        "description": "Fresh fish from Erhai Lake, prepared in traditional Bai style."
      }
    ],
    "foodStreets": [
      {
        "name": "Dali Ancient Town Food Street",
        "description": "Traditional Bai cuisine and local specialties in the historic old town."
      },
      {
        "name": "Xizhou Town",
        "description": "Famous for local snacks and traditional Bai ethnic minority cuisine."
      }
    ],
    "signature_dishes": [
      {
        "name": "Dali Clay Pot Fish (大理砂锅鱼)",
        "description": "Fish stewed in clay pot with tofu and vegetables"
      },
      {
        "name": "Rushan (乳扇)",
        "description": "Fried cheese made from cow's milk"
      },
      {
        "name": "Bai Ethnic Sour Fish (白族酸辣鱼)",
        "description": "Sour and spicy fish with papaya"
      },
      {
        "name": "Crossing Bridge Noodles (过桥米线)",
        "description": "Local version of famous Yunnan noodles"
      },
      {
        "name": "Wild Mushroom Hot Pot (野生菌火锅)",
        "description": "Seasonal mushroom hot pot"
      }
    ],
    "street_food": [
      "Rushan",
      "Grilled Erkuai",
      "Rose Cake",
      "Yogurt"
    ],
    "famous_restaurants": [
      "Yang Can Zi",
      "Mei Zi Jing",
      "Xiao Pi Jiu"
    ],
    "food_icon": "https://kimi-web-img.moonshot.cn/img/s.alicdn.com/5acb1d3ba632b05587e81fcf96dc1d6783d35368.jpg"
  },
  "transportation": {
    "gettingThere": [
      "By Air: Dali Airport (DLU) with domestic flights from major Chinese cities",
      "By Train: High-speed rail connects Dali to Kunming and other Yunnan cities",
      "By Bus: Long-distance bus services from Kunming and neighboring cities"
    ],
    "gettingAround": [
      "Bicycle: Popular way to explore Erhai Lake and surrounding areas",
      "Taxi: Available for short distances within the city",
      "Bus: Local bus services to major attractions",
      "Walking: Best way to explore Dali Ancient Town"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Ancient Town Exploration",
      "activities": [
        "Morning: Explore Dali Ancient Town and its traditional Bai architecture",
        "Afternoon: Visit Three Pagodas and Chongsheng Temple",
        "Evening: Walk around the ancient town when it's beautifully lit"
      ]
    },
    {
      "day": "Day 2: Nature and Culture",
      "activities": [
        "Morning: Take a cable car up Cangshan Mountains for hiking trails",
        "Afternoon: Rent a bicycle and cycle around Erhai Lake",
        "Evening: Enjoy local Bai cuisine in Xizhou Town"
      ]
    },
    {
      "day": "Day 3: Local Experience",
      "activities": [
        "Morning: Visit local markets and experience Bai ethnic culture",
        "Afternoon: Explore Xizhou Town and try local specialties",
        "Evening: Relax by Erhai Lake and enjoy the sunset"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/dali_1_optimized.jpg",
    "../images/user_photos/dali_2_optimized.jpg",
    "../images/user_photos/dali_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "DALI UNIVERSITY"
    },
    {
      "number": "CN117111121A",
      "title": "Erhai Lake water quality monitoring system",
      "assignee": "DALI ENVIRONMENTAL PROTECTION BUREAU"
    },
    {
      "number": "CN116222232A",
      "title": "Bai ethnic traditional craft preservation method",
      "assignee": "DALI UNIVERSITY"
    },
    {
      "number": "CN115333343A",
      "title": "Marble carving automated processing equipment",
      "assignee": "DALI MARBLE INDUSTRY CO., LTD."
    },
    {
      "number": "CN117444454A",
      "title": "Tourism scenic area smart guide system",
      "assignee": "DALI TOURISM GROUP CO., LTD."
    },
    {
      "number": "CN116555565A",
      "title": "Highland agriculture greenhouse climate control",
      "assignee": "DALI ACADEMY OF AGRICULTURAL SCIENCES"
    },
    {
      "number": "CN115666676A",
      "title": "Traditional fermented cheese production method",
      "assignee": "DALI UNIVERSITY OF TRADITIONAL MEDICINE"
    },
    {
      "number": "CN117777787A",
      "title": "Ethnic silver jewelry digital design system",
      "assignee": "DALI ARTS AND CRAFTS RESEARCH INSTITUTE"
    },
    {
      "number": "CN116888886A",
      "title": "Plateau lake ecosystem restoration method",
      "assignee": "DALI INSTITUTE OF ENVIRONMENTAL SCIENCES"
    },
    {
      "number": "CN115999997A",
      "title": "Ancient town building preservation technology",
      "assignee": "DALI CULTURAL HERITAGE PROTECTION CENTER"
    }
  ]
}