{
  "name": "Datong",
  "title": "Datong - Traveling China like your home yard",
  "heroTitle": "Datong",
  "heroSubtitle": "Ancient Capital & Modern Metropolis",
  "heroImage": "../images/user_photos/datong_hero_bg.jpg",
  "overview": "Datong, located in northern Shanxi Province near the border with Inner Mongolia, stands as one of China's most remarkable repositories of Buddhist art and architecture. This city of 3 million people served as the capital of the Northern Wei Dynasty during the 5th and 6th centuries, a pivotal period when Buddhism flourished and spread throughout China. The legacy of this golden age remains visible in the extraordinary monuments that have made Datong a UNESCO World Heritage destination and a pilgrimage site for art historians, religious scholars, and travelers from around the world. The Yungang Grottoes represent Datong's crowning glory—a series of 252 caves and niches containing over 51,000 Buddhist statues carved into the sandstone cliffs. Created between 460 and 525 AD, these sculptures range from tiny figures barely an inch tall to colossal Buddhas standing 17 meters high. The artistry displayed here represents the fusion of Indian Gandharan styles with Chinese aesthetic traditions, creating a unique visual language that would influence Buddhist art throughout East Asia. The sheer scale and artistic sophistication of Yungang make it one of the three great Buddhist cave temple sites of China, alongside Dunhuang and Longmen. Equally impressive is the Hanging Temple (Xuankong Si), perched precariously 75 meters high on a sheer cliff face about 65 kilometers from Datong. This architectural marvel, built over 1,500 years ago, defies gravity with its wooden structures supported by thin stilts and rock-hewn beams. Remarkably, the temple is dedicated to three religions—Buddhism, Taoism, and Confucianism—with statues of all three traditions sharing the same sacred space. Datong itself has undergone extensive renovation of its ancient city wall and traditional neighborhoods, creating a pleasing historic atmosphere that complements its world-class archaeological treasures. The city's cuisine reflects its northern location with hearty wheat-based dishes, most notably the famous Datong knife-cut noodles, shaved directly from a block of dough into boiling water for a uniquely chewy texture.",
  "highlights": {
    "attractions": "Yungang Grottoes (UNESCO World Heritage), Datong Ancient City Wall (Ming Dynasty), Nine Dragon Screen (ancient glazed tile mural), Huayan Temple",
    "cuisine": "Datong Knife-cut Noodles (Dao Xiao Mian), Braised Lamb (Hong Shao Yang Rou), Shanxi Vinegar dishes, You Mian (oat noodles)",
    "bestTime": "Spring (April-May) and Autumn (September-October) with mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Datong Knife-cut Noodles",
        "description": "Hand-cut noodles with unique texture, served with various sauces and toppings."
      },
      {
        "name": "Braised Lamb",
        "description": "Tender lamb slow-cooked with traditional Shanxi spices and seasonings."
      },
      {
        "name": "Shanxi Vinegar Dishes",
        "description": "Local dishes featuring the famous aged Shanxi vinegar as a key ingredient."
      }
    ],
    "foodStreets": [
      {
        "name": "Datong Ancient City Food Street",
        "description": "Traditional Shanxi cuisine and local specialties in the historic city center."
      },
      {
        "name": "Yungang Grottoes Area",
        "description": "Local restaurants serving authentic Datong dishes near the famous grottoes."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Datong Yungang Airport (DAT) with domestic flights from major cities",
      "By Train: High-speed rail connects Datong to Beijing, Taiyuan, and other cities",
      "By Bus: Long-distance bus services from Beijing and neighboring provinces"
    ],
    "gettingAround": [
      "Bus: Public bus system connecting major attractions",
      "Taxi: Available for convenient travel within the city",
      "Walking: Best way to explore the ancient city area",
      "Tour Bus: Organized tours to Yungang Grottoes and other attractions"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Buddhist Heritage",
      "activities": [
        "Morning: Visit Yungang Grottoes (UNESCO World Heritage site)",
        "Afternoon: Explore Huayan Temple and its ancient architecture",
        "Evening: Walk around Datong Ancient City Wall area"
      ]
    },
    {
      "day": "Day 2: Ancient Architecture",
      "activities": [
        "Morning: Visit the Nine Dragon Screen (ancient glazed tile mural)",
        "Afternoon: Explore Datong Ancient City Wall and historic center",
        "Evening: Enjoy local Shanxi cuisine at traditional restaurants"
      ]
    },
    {
      "day": "Day 3: Cultural Experience",
      "activities": [
        "Morning: Visit local museums and cultural sites",
        "Afternoon: Explore traditional markets and try local snacks",
        "Evening: Experience Datong's night market and street food"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/datong_1_optimized.jpg",
    "../images/user_photos/datong_2_optimized.jpg",
    "../images/user_photos/datong_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "DATONG UNIVERSITY"
    },
    {
      "number": "CN117111122A",
      "title": "Coal mining safety monitoring system",
      "assignee": "DATONG COAL MINING GROUP CO., LTD."
    },
    {
      "number": "CN116222233A",
      "title": "Buddhist grotto preservation nanomaterial coating",
      "assignee": "DATONG CULTURAL HERITAGE RESEARCH INSTITUTE"
    },
    {
      "number": "CN115333344A",
      "title": "High-speed rail wheel material for heavy loads",
      "assignee": "CRRC DATONG CO., LTD."
    },
    {
      "number": "CN117444455A",
      "title": "Ancient city wall structural reinforcement method",
      "assignee": "DATONG UNIVERSITY"
    },
    {
      "number": "CN116555566A",
      "title": "Clean coal technology for emission reduction",
      "assignee": "DATONG INSTITUTE OF COAL CHEMISTRY"
    },
    {
      "number": "CN115666677A",
      "title": "Traditional vinegar fermentation process optimization",
      "assignee": "DATONG VINEGAR INDUSTRY CO., LTD."
    },
    {
      "number": "CN117777788A",
      "title": "Wind energy storage system for plateau regions",
      "assignee": "DATONG POWER SUPPLY BUREAU"
    },
    {
      "number": "CN116888887A",
      "title": "Mining equipment automation control system",
      "assignee": "DATONG HEAVY INDUSTRY GROUP"
    },
    {
      "number": "CN115999998A",
      "title": "Historic architecture 3D scanning documentation",
      "assignee": "DATONG MUSEUM"
    }
  ]
}