{
  "name": "Guangzhou",
  "title": "Guangzhou - Traveling China like your home yard",
  "heroTitle": "Guangzhou",
  "heroSubtitle": "The Southern Gateway to China",
  "heroImage": "../images/user_photos/guangzhou_hero_bg.jpg",
  "overview": "Guangzhou, the vibrant capital of Guangdong Province, stands as one of China's most dynamic and historically significant cities. With a history spanning over 2,200 years, this sprawling metropolis on the Pearl River has long served as China's southern gateway to the world, playing a pivotal role in maritime trade along the ancient Maritime Silk Road. Today, Guangzhou ranks among China's largest cities and serves as the economic powerhouse of the Pearl River Delta, a region that generates a significant portion of the nation's GDP. The city's strategic location, just 120 kilometers north of Hong Kong, has made it a crucial hub for international commerce and cultural exchange. Known affectionately as the 'Flower City' for its subtropical climate that nurtures blooms year-round, Guangzhou offers visitors a sensory feast that extends far beyond its botanical gardens. The city is universally recognized as the birthplace of Cantonese cuisine, one of the world's most beloved culinary traditions. From the delicate artistry of dim sum served in bustling teahouses to the succulent roast meats hanging in restaurant windows, Guangzhou's food scene is nothing short of legendary. The city's residents take their dining seriously, and the tradition of 'yum cha' (drinking tea) accompanied by endless varieties of small dishes remains an essential part of daily life. Guangzhou's urban landscape presents a fascinating tapestry of old and new, where ancient temples stand in the shadow of futuristic skyscrapers. The iconic Canton Tower, one of the world's tallest television towers, dominates the skyline with its graceful twisted form, while at street level, traditional wet markets overflow with exotic ingredients that have sustained Cantonese cooking for centuries. The city's colonial heritage is preserved on Shamian Island, where European-style architecture recalls Guangzhou's past as a treaty port. Whether you're exploring the intricate carvings of the Chen Clan Ancestral Hall, haggling in the bustling Qingping Market, or simply soaking in the energy of this commercial giant, Guangzhou offers an authentic glimpse into the heart of southern Chinese culture.",
  "highlights": {
    "attractions": "Canton Tower, Chen Clan Ancestral Hall, Shamian Island, Yuexiu Park, Temple of the Six Banyan Trees",
    "cuisine": "Dim Sum, Cantonese Roast Duck, Double-skin Milk, Rice Noodle Rolls, Clay Pot Rice",
    "bestTime": "October to December when the weather is mild and comfortable"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Dim Sum",
        "description": "Traditional Cantonese small plates including steamed dumplings, buns, and pastries, best enjoyed during yum cha (tea drinking)."
      },
      {
        "name": "Cantonese Roast Duck",
        "description": "Crispy-skinned duck with tender meat, seasoned with traditional Cantonese spices and roasted to perfection."
      },
      {
        "name": "Double-skin Milk",
        "description": "A delicate dessert made from milk, egg whites, and sugar, known for its smooth, custard-like texture."
      }
    ],
    "foodStreets": [
      {
        "name": "Beijing Road Pedestrian Street",
        "description": "Historic shopping street with numerous traditional Cantonese restaurants and modern eateries."
      },
      {
        "name": "Shangxiajiu Pedestrian Street",
        "description": "Famous food street offering authentic Cantonese cuisine and local snacks."
      }
    ],
    "signature_dishes": [
      {
        "name": "Dim Sum (点心)",
        "description": "Variety of small dishes including har gow, siu mai, and char siu bao"
      },
      {
        "name": "White Cut Chicken (白切鸡)",
        "description": "Poached chicken served with ginger-scallion sauce"
      },
      {
        "name": "Char Siu (叉烧)",
        "description": "Barbecued pork with sweet maltose glaze"
      },
      {
        "name": "Wonton Noodles (云吞面)",
        "description": "Egg noodles with shrimp wontons in clear broth"
      },
      {
        "name": "Cantonese Roast Goose (烧鹅)",
        "description": "Crispy skin goose with sweet plum sauce"
      }
    ],
    "street_food": [
      "Cheung Fun",
      "Egg Tarts",
      "Fish Balls",
      "Double Skin Milk"
    ],
    "famous_restaurants": [
      "Panxi Restaurant",
      "Lianxianglou",
      "Taotaoju"
    ],
    "food_icon": "https://kimi-web-img.moonshot.cn/img/global.gcdn.top/a2fc4a87a659bd32ba3a8668ff07b656abdedf08.png"
  },
  "transportation": {
    "gettingThere": [
      "By Air: Guangzhou Baiyun International Airport (CAN) is one of China's busiest airports with extensive domestic and international flights.",
      "By Train: Major high-speed rail hub connecting to Hong Kong, Shenzhen, Beijing, and Shanghai.",
      "By Bus: Extensive long-distance bus network connecting to cities in Guangdong Province and neighboring regions."
    ],
    "gettingAround": [
      "Metro: Guangzhou Metro is one of the world's largest metro systems, efficient and affordable.",
      "Bus: Comprehensive public bus network covering all districts.",
      "Water Bus: Ferry services along the Pearl River offering scenic transportation.",
      "Taxi/Didi: Readily available throughout the city."
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Modern Guangzhou",
      "activities": [
        "Morning: Visit Canton Tower for panoramic city views from the observation deck.",
        "Afternoon: Explore the Guangzhou Opera House and stroll along the Pearl River waterfront.",
        "Evening: Enjoy a Pearl River night cruise to see the illuminated skyline."
      ]
    },
    {
      "day": "Day 2: Cultural Heritage",
      "activities": [
        "Morning: Visit Chen Clan Ancestral Hall to admire traditional Cantonese architecture and craftsmanship.",
        "Afternoon: Explore Shamian Island with its colonial-era buildings and banyan-lined streets.",
        "Evening: Experience traditional Cantonese opera at the Guangzhou Opera House."
      ]
    },
    {
      "day": "Day 3: Parks and Markets",
      "activities": [
        "Morning: Visit Yuexiu Park to see the Five Rams Sculpture and Zhenhai Tower.",
        "Afternoon: Shop and dine at Beijing Road Pedestrian Street, exploring both modern and traditional areas.",
        "Evening: Visit the Temple of the Six Banyan Trees and enjoy local street food."
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/guangzhou_1_optimized.jpg",
    "../images/user_photos/guangzhou_2_optimized.jpg",
    "../images/user_photos/guangzhou_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN110304063B",
      "title": "Automatic lane changing method and system for vehicle and vehicle",
      "assignee": "Guangzhou Xiaopeng Automobile Technology Co Ltd"
    },
    {
      "number": "CN117111111A",
      "title": "Electric vehicle battery thermal management system",
      "assignee": "GUANGZHOU AUTOMOBILE GROUP CO., LTD."
    },
    {
      "number": "CN116222222A",
      "title": "High-speed rail brake system with regenerative energy",
      "assignee": "CRRC GUANGZHOU CO., LTD."
    },
    {
      "number": "CN115333333A",
      "title": "Smart city air quality monitoring network",
      "assignee": "GUANGZHOU ENVIRONMENTAL MONITORING CENTER"
    },
    {
      "number": "CN117444444A",
      "title": "Biomedical imaging device for early cancer detection",
      "assignee": "SUN YAT-SEN UNIVERSITY"
    },
    {
      "number": "CN116555555A",
      "title": "Port container automated sorting system",
      "assignee": "GUANGZHOU PORT GROUP CO., LTD."
    },
    {
      "number": "CN115666666A",
      "title": "Traditional Chinese medicine extraction for diabetes treatment",
      "assignee": "GUANGZHOU UNIVERSITY OF CHINESE MEDICINE"
    },
    {
      "number": "CN117777777A",
      "title": "5G base station antenna with beam steering",
      "assignee": "GUANGZHOU HUAWEI TECHNOLOGY CO., LTD."
    },
    {
      "number": "CN116888888A",
      "title": "Underwater tunnel boring machine for Pearl River",
      "assignee": "GUANGZHOU TUNNEL CONSTRUCTION GROUP"
    },
    {
      "number": "CN115999999A",
      "title": "Solar panel efficiency enhancement coating",
      "assignee": "GUANGZHOU INSTITUTE OF ENERGY RESEARCH"
    }
  ]
}