{
  "name": "Guilin",
  "title": "Guilin - Traveling China like your home yard",
  "heroTitle": "Guilin",
  "heroSubtitle": "Karst Landscapes & Li River Beauty",
  "heroImage": "../images/user_photos/guilin_hero_bg.jpg",
  "overview": "Guilin, whose name means 'Forest of Sweet Osmanthus,' has captivated travelers for over a thousand years with its otherworldly karst mountain scenery. Located in northeastern Guangxi Zhuang Autonomous Region along the banks of the Li River, this city of 5 million people sits amidst a landscape so dramatically beautiful that it appears almost surreal. The jagged limestone peaks that rise abruptly from the flat river valleys have inspired countless Chinese poets and painters, with the classic image of Guilin's mist-shrouded mountains gracing everything from traditional scroll paintings to modern currency. The relationship between Guilin and the Li River defines the city's identity. This 83-kilometer waterway, flowing south through the karst landscape to Yangshuo, offers what many consider the most beautiful river cruise in China. Traditional bamboo rafts and modern tourist boats glide past formations with evocative names like Elephant Trunk Hill, Folded Brocade Hill, and Nine Horse Fresco Hill, each representing millions of years of geological sculpting. The riverbanks are dotted with traditional villages where farmers tend rice paddies and water buffalo wallow in mud, preserving a way of life that has changed little over centuries. Beyond its natural wonders, Guilin offers rich cultural experiences. The city has been a regional center since the Qin Dynasty over 2,000 years ago, serving as a strategic military outpost and cultural crossroads. The Reed Flute Cave, adorned with stalactites and stalagmites illuminated in rainbow colors, contains inscriptions dating back to the Tang Dynasty. Guilin's cuisine reflects its Guangxi location, featuring rice noodles that are famous throughout China, along with unique local specialties like oil tea and beer fish. Whether you're cruising the Li River at sunrise, cycling through the Yangshuo countryside, or simply watching the evening light fade over the karst peaks, Guilin offers a visual feast that lives up to its ancient reputation as the most beautiful place under heaven.",
  "highlights": {
    "attractions": "Li River Cruise, Yangshuo Countryside, Elephant Trunk Hill, Reed Flute Cave",
    "cuisine": "Guilin Rice Noodles, Beer Fish, Oil Tea, Lipu Taro Loaf",
    "bestTime": "Spring (April-May) and Autumn (September-October) with mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Guilin Rice Noodles",
        "description": "Famous local rice noodles served with savory broth, pickled vegetables, and various toppings."
      },
      {
        "name": "Beer Fish",
        "description": "Fresh river fish cooked with beer and local spices, a Yangshuo specialty."
      },
      {
        "name": "Oil Tea",
        "description": "Traditional tea-based soup with various ingredients, unique to the region."
      }
    ],
    "foodStreets": [
      {
        "name": "Guilin Night Market",
        "description": "Vibrant night market with local street food and specialties."
      },
      {
        "name": "Yangshuo West Street",
        "description": "Popular tourist area with restaurants serving local and international cuisine."
      }
    ],
    "signature_dishes": [
      {
        "name": "Guilin Rice Noodles (桂林米粉)",
        "description": "Rice noodles with braised meat and pickled vegetables"
      },
      {
        "name": "Beer Fish (啤酒鱼)",
        "description": "Fresh river fish cooked with beer"
      },
      {
        "name": "Stuffed Li River Snails (田螺酿)",
        "description": "Snails stuffed with pork and mint"
      },
      {
        "name": "Oil Tea (油茶)",
        "description": "Traditional tea with fried rice and peanuts"
      },
      {
        "name": "Bamboo Rice (竹筒饭)",
        "description": "Rice cooked in fresh bamboo tubes"
      }
    ],
    "street_food": [
      "Rice Noodles",
      "Stuffed Snails",
      "Water Chestnut Cake",
      "Taro Cake"
    ],
    "famous_restaurants": [
      "Chong Shan Mi Fen",
      "Xie San Jie",
      "Lao Dong Jiang"
    ],
    "food_icon": "https://kimi-web-img.moonshot.cn/img/ik.imagekit.io/50004b7895d40e8b100cb85e79359f3fa726f910.png"
  },
  "transportation": {
    "gettingThere": [
      "By Air: Guilin Liangjiang International Airport (KWL) with domestic and international flights",
      "By Train: High-speed rail connects Guilin to major cities including Beijing, Shanghai, and Guangzhou",
      "By Bus: Long-distance bus services from neighboring provinces"
    ],
    "gettingAround": [
      "Li River Cruise: Scenic boat tours between Guilin and Yangshuo",
      "Bus: Public transportation to major attractions",
      "Taxi: Available for convenient travel",
      "Bicycle: Popular for exploring Yangshuo countryside"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: City Exploration",
      "activities": [
        "Morning: Visit Elephant Trunk Hill and Fubo Hill",
        "Afternoon: Explore Reed Flute Cave with stunning stalactites",
        "Evening: Walk along the Li River and enjoy local cuisine"
      ]
    },
    {
      "day": "Day 2: Li River Cruise",
      "activities": [
        "Morning: Take Li River cruise to Yangshuo (4-hour scenic journey)",
        "Afternoon: Explore Yangshuo West Street and countryside",
        "Evening: Watch the Impression Liu Sanjie light show"
      ]
    },
    {
      "day": "Day 3: Countryside Experience",
      "activities": [
        "Morning: Bicycle tour through Yangshuo's karst landscape",
        "Afternoon: Visit traditional villages and experience local culture",
        "Evening: Return to Guilin and enjoy river night views"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/guilin_1_optimized.jpg",
    "../images/user_photos/guilin_2_optimized.jpg",
    "../images/user_photos/guilin_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "GUILIN UNIVERSITY OF TECHNOLOGY"
    },
    {
      "number": "CN117111120A",
      "title": "Karst terrain geological monitoring system",
      "assignee": "GUILIN UNIVERSITY OF TECHNOLOGY"
    },
    {
      "number": "CN116222231A",
      "title": "Li River water quality purification method",
      "assignee": "GUILIN ENVIRONMENTAL PROTECTION BUREAU"
    },
    {
      "number": "CN115333342A",
      "title": "Tourism scenic area smart navigation system",
      "assignee": "GUILIN TOURISM GROUP CO., LTD."
    },
    {
      "number": "CN117444453A",
      "title": "Rice noodle automated production equipment",
      "assignee": "GUILIN RICE NOODLE INDUSTRY CO., LTD."
    },
    {
      "number": "CN116555564A",
      "title": "Bamboo weaving craft digitization preservation",
      "assignee": "GUILIN UNIVERSITY"
    },
    {
      "number": "CN115666675A",
      "title": "Cave ecosystem protection and monitoring",
      "assignee": "GUILIN INSTITUTE OF KARST GEOLOGY"
    },
    {
      "number": "CN117777786A",
      "title": "Electric vehicle charging station for scenic areas",
      "assignee": "GUILIN POWER SUPPLY BUREAU"
    },
    {
      "number": "CN116888885A",
      "title": "Traditional Chinese medicine extraction from local herbs",
      "assignee": "GUILIN MEDICAL UNIVERSITY"
    },
    {
      "number": "CN115999996A",
      "title": "Drone aerial photography system for landscape documentation",
      "assignee": "GUILIN UNIVERSITY OF AEROSPACE TECHNOLOGY"
    }
  ]
}