{
  "name": "Guiyang",
  "title": "Guiyang - Traveling China like your home yard",
  "heroTitle": "Guiyang",
  "heroSubtitle": "Forest City & Ethnic Culture",
  "heroImage": "../images/user_photos/guiyang_hero_bg.jpg",
  "overview": "Guiyang, the capital of Guizhou Province, occupies a unique position in China's urban landscape as a city built amidst dramatic karst mountains and lush subtropical forests. Known as the 'Forest City' and 'Cool Capital' for its pleasant summer temperatures, Guiyang offers respite from the heat that blankets much of China during the warmer months. With a population of nearly 6 million, this mountain metropolis serves as the gateway to Guizhou, a province that has emerged from relative obscurity to become one of China's most intriguing destinations for travelers seeking authentic ethnic cultures and pristine natural environments. The city's geography has shaped its development in fascinating ways. Surrounded by mountains and built across several hills and valleys, Guiyang features a landscape where urban development intermingles with green spaces in a manner rarely seen in Chinese cities. The Nanming River winds through the city center, with the historic Jiaxiu Pavilion standing as its most iconic landmark—an elegant three-story structure built in 1598 that has become the symbol of Guiyang. Qianling Mountain rises within the city limits, offering residents and visitors alike easy access to hiking trails, ancient Buddhist temples, and the famous Hongfu Temple, which dates back to the 17th century. Guiyang's greatest treasure lies in its role as a center for Guizhou's extraordinary ethnic diversity. The province is home to 17 of China's 56 recognized ethnic minorities, including the Miao, Dong, Buyi, and Tujia peoples, each maintaining distinct languages, customs, and architectural traditions. The city hosts numerous festivals throughout the year celebrating this cultural richness, while nearby villages offer immersive experiences of traditional lifestyles. Guiyang's cuisine reflects this diversity with bold, distinctive flavors—sour and spicy being the dominant taste profiles. The famous sour soup fish, fermented in a unique local process, exemplifies the culinary innovation that has developed in this isolated mountainous region. As high-speed rail connections have made Guizhou increasingly accessible, Guiyang has emerged as a must-visit destination for travelers seeking to explore one of China's last frontiers of authentic cultural and natural heritage.",
  "highlights": {
    "attractions": "Qianling Park, Jiaxiu Pavilion, Qingyan Ancient Town, Huaxi Park",
    "cuisine": "Sour Fish Soup, Guizhou Spicy Chicken, Rice Tofu, Miao Minority Cuisine",
    "bestTime": "Spring (March-May) and Autumn (September-November) with mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Sour Fish Soup",
        "description": "Traditional Miao minority dish with fresh fish in tangy, spicy broth."
      },
      {
        "name": "Guizhou Spicy Chicken",
        "description": "Local chicken dish cooked with Guizhou's famous spicy seasonings."
      },
      {
        "name": "Rice Tofu",
        "description": "Unique local specialty made from rice, served in various preparations."
      }
    ],
    "foodStreets": [
      {
        "name": "Hequn Road Night Market",
        "description": "Popular night market with local snacks and ethnic minority cuisine."
      },
      {
        "name": "Qingyan Ancient Town",
        "description": "Traditional food street in the historic town with local specialties."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Guiyang Longdongbao International Airport (KWE) with domestic and international flights",
      "By Train: High-speed rail connects Guiyang to major cities including Beijing and Guangzhou",
      "By Bus: Long-distance bus services from neighboring provinces"
    ],
    "gettingAround": [
      "Bus: Comprehensive public bus system",
      "Taxi: Available for convenient travel",
      "Metro: Modern subway system connecting major areas",
      "Walking: Best way to explore parks and historic areas"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: City Exploration",
      "activities": [
        "Morning: Visit Qianling Park and Hongfu Temple",
        "Afternoon: Explore Jiaxiu Pavilion and the surrounding area",
        "Evening: Walk around Hequn Road Night Market"
      ]
    },
    {
      "day": "Day 2: Cultural Heritage",
      "activities": [
        "Morning: Visit Qingyan Ancient Town",
        "Afternoon: Explore Huaxi Park and University area",
        "Evening: Experience local ethnic minority culture"
      ]
    },
    {
      "day": "Day 3: Nature and Culture",
      "activities": [
        "Morning: Visit local museums and cultural sites",
        "Afternoon: Explore karst landscapes and natural areas",
        "Evening: Enjoy local cuisine and cultural performances"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/guiyang_1_optimized.jpg",
    "../images/user_photos/guiyang_2_optimized.jpg",
    "../images/user_photos/guiyang_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "BEIJING INSTITUTE OF TECHNOLOGY"
    }
  ]
}