{
  "name": "Harbin",
  "title": "Harbin - Traveling China like your home yard",
  "heroTitle": "Harbin",
  "heroSubtitle": "Ice City of the North",
  "heroImage": "../images/user_photos/harbin_hero_bg.jpg",
  "overview": "Harbin, the capital of Heilongjiang Province, occupies a unique place in China's urban landscape as the country's northernmost major city and the gateway to Siberia. With a population of over 10 million, this 'Ice City' has transformed its harsh winter climate — where temperatures regularly plunge below -20°C — into its greatest tourist asset. Each year, from December to February, Harbin hosts the world's largest ice and snow festival, attracting millions of visitors who come to marvel at elaborate ice sculptures, illuminated ice castles, and massive snow sculptures that transform the city into a winter wonderland of breathtaking scale and artistry. The city's distinctive character stems from its history as a Russian settlement and its proximity to the Russian border. In the late 19th and early 20th centuries, Harbin became a major hub for the Chinese Eastern Railway, attracting thousands of Russian immigrants who left an indelible mark on the city's architecture and culture. The Saint Sophia Cathedral, with its distinctive green onion domes, stands as the most visible reminder of this heritage, while Central Street (Zhongyang Dajie) preserves one of Asia's longest pedestrian streets lined with European-style buildings. This Russian influence extends to Harbin's cuisine, which features unique dishes like Harbin red sausage, Russian bread, and hearty stews that help residents survive the brutal winters. Beyond the winter festivities, Harbin offers year-round attractions that showcase the region's natural beauty and wildlife. The Siberian Tiger Park, one of the world's largest breeding centers for Siberian tigers, allows visitors to observe these magnificent endangered cats up close. The Sun Island Scenic Area provides a green escape during summer months, while the Songhua River offers recreational activities from boating to ice swimming for the brave. Harbin's music culture is equally impressive, with the city hosting an annual summer music festival and maintaining a tradition of classical music appreciation that dates back to its Russian colonial period. Whether you're bundled up exploring ice palaces or enjoying a Russian-inspired meal in a historic building, Harbin offers an experience unlike any other Chinese city.",
  "highlights": {
    "attractions": "Ice and Snow World, Sun Island Snow Sculpture Art Expo, Saint Sophia Cathedral, Central Street, Siberian Tiger Park",
    "cuisine": "Harbin Red Sausage, Russian Borscht, Guobaorou (Sweet and Sour Pork), Harbin Beer, Dongbei Dumplings",
    "bestTime": "Winter (December-February) for ice festivals and snow activities, or Summer (June-August) for pleasant temperatures and outdoor activities"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Harbin Red Sausage",
        "description": "A smoked pork sausage with Russian origins, known for its distinctive flavor and firm texture."
      },
      {
        "name": "Guobaorou (Sweet and Sour Pork)",
        "description": "Northeastern-style crispy pork with a sweet and sour sauce, different from Cantonese versions."
      },
      {
        "name": "Russian Borscht",
        "description": "Beet soup with Russian influence, served hot with sour cream and bread."
      },
      {
        "name": "Dongbei Dumplings",
        "description": "Large, hearty dumplings filled with pork, cabbage, and other local ingredients."
      }
    ],
    "foodStreets": [
      {
        "name": "Central Street",
        "description": "Historic pedestrian street with Russian restaurants and local snack vendors."
      },
      {
        "name": "Old Harbin District",
        "description": "Traditional restaurants serving authentic Dongbei cuisine."
      },
      {
        "name": "Harbin Beer Street",
        "description": "Local beer culture with food stalls and traditional snacks."
      }
    ],
    "signature_dishes": [
      {
        "name": "Guo Bao Rou (锅包肉)",
        "description": "Sweet and sour crispy pork slices"
      },
      {
        "name": "Harbin Sausage (哈尔滨红肠)",
        "description": "Smoked Russian-style sausage"
      },
      {
        "name": "Stewed Chicken with Mushrooms (小鸡炖蘑菇)",
        "description": "Hearty chicken stew with wild mushrooms"
      },
      {
        "name": "Braised Pork with Vermicelli (猪肉炖粉条)",
        "description": "Pork belly with glass noodles"
      },
      {
        "name": "Russian Bread (大列巴)",
        "description": "Large dense rye bread"
      }
    ],
    "street_food": [
      "Grilled Cold Noodles",
      "Sugar Gourd",
      "Ice Cream",
      "Sausage"
    ],
    "famous_restaurants": [
      "Lao Chang Chun",
      "Hua Mei",
      "Da Lie Ba"
    ],
    "food_icon": "https://kimi-web-img.moonshot.cn/img/upload.wikimedia.org/f7ca13b9da6dfe9fa8fb6ce5d61d435c8ad432a5.jpg"
  },
  "transportation": {
    "gettingThere": [
      "By Air: Harbin Taiping International Airport (HRB) with domestic flights and international connections to Russia and other Asian countries.",
      "By Train: Major railway hub with high-speed rail connections to Beijing, Shanghai, and other major cities.",
      "By Bus: Long-distance bus services connecting to nearby provinces and Russian border areas."
    ],
    "gettingAround": [
      "Metro: Harbin's metro system provides efficient transportation to major attractions and districts.",
      "Bus: Comprehensive public bus network covering the urban area and tourist attractions.",
      "Taxi: Readily available taxis with reasonable fares for city exploration.",
      "Walking: Central areas like Central Street are best explored on foot to appreciate the architecture."
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Ice Festival and Central Street",
      "activities": [
        "Morning: Visit Ice and Snow World for spectacular ice sculptures and ice architecture.",
        "Afternoon: Explore Central Street with its Russian-style buildings and European architecture.",
        "Evening: Enjoy Russian cuisine at a traditional restaurant on Central Street."
      ]
    },
    {
      "day": "Day 2: Wildlife and Culture",
      "activities": [
        "Morning: Visit the Siberian Tiger Park to see these magnificent animals in their natural habitat.",
        "Afternoon: Explore Saint Sophia Cathedral and the Russian Orthodox Church complex.",
        "Evening: Experience local nightlife and try Harbin beer at a traditional brewery."
      ]
    },
    {
      "day": "Day 3: Nature and Parks",
      "activities": [
        "Morning: Visit Sun Island Snow Sculpture Art Expo for incredible snow sculptures.",
        "Afternoon: Explore the Songhua River waterfront and enjoy winter activities.",
        "Evening: Take a river cruise or enjoy ice skating on the frozen Songhua River."
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/harbin_1_optimized.jpg",
    "../images/user_photos/harbin_2_optimized.jpg",
    "../images/user_photos/harbin_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN106897282B",
      "title": "User group classification method and device",
      "assignee": "Harbin Institute of Technology"
    },
    {
      "number": "CN108418780A",
      "title": "Filter method and device, system, the dns server of IP address",
      "assignee": "Harbin Engineering University"
    },
    {
      "number": "CN108804885B",
      "title": "Man-machine verification method and device, storage medium and processor",
      "assignee": "Harbin University of Science and Technology"
    },
    {
      "number": "CN117111118A",
      "title": "Ice sculpture 3D printing system with rapid freezing",
      "assignee": "HARBIN INSTITUTE OF TECHNOLOGY"
    },
    {
      "number": "CN116222229A",
      "title": "Turbine blade material for extreme cold environments",
      "assignee": "HARBIN ELECTRIC CORPORATION"
    },
    {
      "number": "CN115333340A",
      "title": "Aerospace composite material with cryogenic resistance",
      "assignee": "HARBIN INSTITUTE OF TECHNOLOGY"
    },
    {
      "number": "CN117444451A",
      "title": "Smart heating system for energy-efficient buildings",
      "assignee": "HARBIN INSTITUTE OF TECHNOLOGY"
    },
    {
      "number": "CN116555562A",
      "title": "High-speed rail wheelset for low-temperature operation",
      "assignee": "CRRC HARBIN CO., LTD."
    },
    {
      "number": "CN115666673A",
      "title": "Traditional Chinese medicine extraction for cold climate adaptation",
      "assignee": "HEILONGJIANG UNIVERSITY OF CHINESE MEDICINE"
    },
    {
      "number": "CN117777784A",
      "title": "Winter sports equipment manufacturing method",
      "assignee": "HARBIN SPORT UNIVERSITY"
    }
  ]
}