{
  "name": "Hongkong",
  "title": "Hongkong - Traveling China like your home yard",
  "heroTitle": "Hongkong",
  "heroSubtitle": "Asia's World City",
  "heroImage": "../images/user_photos/hongkong_hero_bg.jpg",
  "overview": "Hong Kong stands as one of the world's most dynamic urban centers, a Special Administrative Region of China that has maintained its unique character despite returning to Chinese sovereignty in 1997. This compact territory of just 1,100 square kilometers packs over 7 million people into a dramatic landscape of skyscrapers, mountains, and harbor. For over a century and a half of British colonial rule, Hong Kong developed into a global financial powerhouse while preserving its Chinese cultural roots, creating a fascinating hybrid where East truly meets West in every aspect of daily life. The city's iconic skyline, dominated by the Bank of China Tower and International Commerce Centre, rises from Victoria Harbour in a density that must be seen to be believed. Yet just minutes from the central business district, visitors can find themselves hiking through country parks, exploring traditional fishing villages, or relaxing on secluded beaches. This remarkable contrast defines Hong Kong's appeal — a place where you can experience the world's most efficient public transportation system, shop in luxury malls, then escape to mountain trails or island getaways all in the same day. The famous Star Ferry crossing between Hong Kong Island and Kowloon has been operating for over a century and remains one of the world's most scenic and affordable harbor cruises. Hong Kong's culinary scene is legendary, with the city boasting the highest density of restaurants per capita in the world. From Michelin-starred dim sum to humble dai pai dong (street food stalls), the food culture here is unparalleled. The city's film industry helped define Hong Kong cinema globally, while its music and fashion scenes continue to influence trends across Asia. Whether you're watching the sunrise over Tiananmen Square, hiking an unrestored section of the Great Wall, or exploring the hip cafes of Sanlitun, Hong Kong offers an endless array of experiences that capture the essence of China's past, present, and future.",
  "highlights": {
    "attractions": "Victoria Peak, Victoria Harbour, Tsim Sha Tsui, Big Buddha, Ocean Park",
    "cuisine": "Dim Sum, Roast Goose, Egg Waffles, Hong Kong-style Milk Tea",
    "bestTime": "Autumn (October-December) and Spring (March-May) with comfortable weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Dim Sum",
        "description": "Traditional Cantonese small plates served with tea, featuring dumplings, buns, and pastries."
      },
      {
        "name": "Roast Goose",
        "description": "Perfectly roasted goose with crispy skin and tender meat, a Hong Kong specialty."
      },
      {
        "name": "Egg Waffles",
        "description": "Popular street snack with crispy exterior and soft, eggy interior."
      }
    ],
    "foodStreets": [
      {
        "name": "Temple Street Night Market",
        "description": "Famous night market with street food, fortune tellers, and local atmosphere."
      },
      {
        "name": "Mongkok Food Streets",
        "description": "Multiple food streets in Mongkok offering diverse local and international cuisine."
      }
    ],
    "signature_dishes": [
      {
        "name": "Dim Sum (点心)",
        "description": "Variety of steamed and fried small dishes"
      },
      {
        "name": "Roast Goose (烧鹅)",
        "description": "Crispy Cantonese-style roast goose"
      },
      {
        "name": "Wonton Noodles (云吞面)",
        "description": "Shrimp wontons in egg noodle soup"
      },
      {
        "name": "Egg Tart (蛋挞)",
        "description": "Flaky pastry with creamy egg custard"
      },
      {
        "name": "Pineapple Bun (菠萝包)",
        "description": "Sweet bun with crispy sugar topping"
      }
    ],
    "street_food": [
      "Egg Waffles",
      "Fish Balls",
      "Stinky Tofu",
      "Milk Tea"
    ],
    "famous_restaurants": [
      "Yung Kee",
      "Tim Ho Wan",
      "One Dim Sum"
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Hong Kong International Airport (HKG), major international hub",
      "By Train: High-speed rail connects to mainland China cities",
      "By Ferry: Regular ferry services from Macau and mainland China"
    ],
    "gettingAround": [
      "MTR: Efficient subway system covering all major areas",
      "Bus: Comprehensive bus network including double-decker buses",
      "Tram: Historic Peak Tram and Hong Kong Tramways",
      "Star Ferry: Iconic ferry service across Victoria Harbour"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Iconic Hong Kong",
      "activities": [
        "Morning: Take Peak Tram to Victoria Peak for panoramic views",
        "Afternoon: Explore Central and Sheung Wan districts",
        "Evening: Watch Symphony of Lights show from Tsim Sha Tsui"
      ]
    },
    {
      "day": "Day 2: Culture & Markets",
      "activities": [
        "Morning: Visit Big Buddha and Po Lin Monastery on Lantau Island",
        "Afternoon: Explore Temple Street Night Market",
        "Evening: Enjoy authentic dim sum dinner"
      ]
    },
    {
      "day": "Day 3: Modern & Traditional",
      "activities": [
        "Morning: Visit Hong Kong Museum of History",
        "Afternoon: Shop in Causeway Bay and explore street markets",
        "Evening: Harbor cruise and seafood dinner"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/hongkong_1_optimized.jpg",
    "../images/user_photos/hongkong_2_optimized.jpg",
    "../images/user_photos/hongkong_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "HONG KONG UNIVERSITY OF SCIENCE AND TECHNOLOGY"
    },
    {
      "number": "CN117111119A",
      "title": "Financial transaction security system using blockchain",
      "assignee": "HANG SENG BANK LIMITED"
    },
    {
      "number": "CN116222230A",
      "title": "Smart port logistics optimization with AI scheduling",
      "assignee": "HONG KONG INTERNATIONAL TERMINALS LIMITED"
    },
    {
      "number": "CN115333341A",
      "title": "Biomedical imaging device for cancer diagnosis",
      "assignee": "CHINESE UNIVERSITY OF HONG KONG"
    },
    {
      "number": "CN117444452A",
      "title": "High-rise building fire safety evacuation system",
      "assignee": "HONG KONG POLYTECHNIC UNIVERSITY"
    },
    {
      "number": "CN116555563A",
      "title": "Underwater tunnel construction method for cross-harbor transit",
      "assignee": "MTR CORPORATION LIMITED"
    },
    {
      "number": "CN115666674A",
      "title": "Traditional Chinese medicine formula for immune enhancement",
      "assignee": "HONG KONG BAPTIST UNIVERSITY"
    },
    {
      "number": "CN117777785A",
      "title": "Smart city waste management with automated sorting",
      "assignee": "HONG KONG WASTE MANAGEMENT ASSOCIATION"
    },
    {
      "number": "CN116888884A",
      "title": "Renewable energy storage system for urban grid",
      "assignee": "CLP POWER HONG KONG LIMITED"
    },
    {
      "number": "CN115999995A",
      "title": "Marine pollution monitoring and cleanup vessel",
      "assignee": "HONG KONG UNIVERSITY"
    }
  ]
}