{
  "name": "Jinan",
  "title": "Jinan - Traveling China like your home yard",
  "heroTitle": "Jinan",
  "heroSubtitle": "City of Springs",
  "heroImage": "../images/user_photos/jinan_hero_bg.jpg",
  "overview": "Jinan, the capital of Shandong Province, holds a unique distinction among Chinese cities as the 'City of Springs,' with over 100 natural artesian springs bubbling up through the urban landscape. This remarkable geological feature has shaped Jinan's identity for more than 3,500 years, making it one of the oldest continuously inhabited cities in China. The springs, fed by underground limestone aquifers, create a network of waterways that flow through the city center, filling lakes, feeding rivers, and creating an oasis-like environment in the heart of this metropolis of 9 million people. The relationship between Jinan and its springs is deeply embedded in Chinese cultural history. The Baotu Spring, known as the 'First Spring Under Heaven,' has been celebrated by poets and emperors for millennia, its three bubbling spouts creating a mesmerizing display that changes intensity with the seasons. The nearby Daming Lake, formed by the convergence of multiple springs, has inspired countless works of literature and art. This abundance of fresh water has made Jinan a place of strategic importance throughout Chinese history, serving as a political and cultural center for the region and nurturing a refined urban culture that values education, art, and natural beauty. Jinan's location makes it a perfect base for exploring some of China's most significant cultural and natural sites. The city serves as the gateway to Mount Tai, the foremost of China's Five Great Mountains and a UNESCO World Heritage Site that has been a place of imperial pilgrimage for over 3,000 years. The philosopher Confucius was born in nearby Qufu, and his temple, mansion, and cemetery form another UNESCO site easily accessible from Jinan. The city's cuisine reflects its Shandong heritage, considered one of the eight great traditions of Chinese cooking, with dishes emphasizing fresh seafood, spring water, and delicate flavors. Whether you're watching the sunrise over Baotu Spring, strolling around Daming Lake, or using Jinan as a base to explore Mount Tai, this city of springs offers a refreshing blend of natural wonder and deep cultural significance.",
  "highlights": {
    "attractions": "Baotu Spring Park, Daming Lake, Thousand Buddha Mountain, Lingyan Temple",
    "cuisine": "Shandong Cuisine, Sweet and Sour Carp, Dezhou Braised Chicken, Jinan Dumplings",
    "bestTime": "Spring (April-May) and Autumn (September-October) with pleasant weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Sweet and Sour Carp",
        "description": "Fresh carp from Daming Lake prepared with traditional sweet and sour sauce."
      },
      {
        "name": "Dezhou Braised Chicken",
        "description": "Famous Shandong dish with tender chicken and rich, flavorful sauce."
      },
      {
        "name": "Jinan Dumplings",
        "description": "Local dumplings with various fillings, known for their delicate wrappers."
      }
    ],
    "foodStreets": [
      {
        "name": "Furong Street",
        "description": "Historic food street with traditional Shandong cuisine and local snacks."
      },
      {
        "name": "Quancheng Road",
        "description": "Popular dining area with restaurants serving local specialties."
      }
    ],
    "signature_dishes": [
      {
        "name": "Sweet and Sour Carp (糖醋鲤鱼)",
        "description": "Yellow River carp in sweet and sour sauce"
      },
      {
        "name": "Braised Intestines (九转大肠)",
        "description": "Pork intestines braised with spices"
      },
      {
        "name": "Jinan Dumplings (济南饺子)",
        "description": "Handmade dumplings with various fillings"
      },
      {
        "name": "Oil Spinach (油旋)",
        "description": "Layered flaky scallion bread"
      },
      {
        "name": "Yellow River Carp (黄河鲤鱼)",
        "description": "Fresh carp from the Yellow River"
      }
    ],
    "street_food": [
      "Oil Spinach",
      "Sweet Foam",
      "Roujiamo",
      "Tofu Jelly"
    ],
    "famous_restaurants": [
      "De Xing She",
      "Yan Xi",
      "Ju Feng De"
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Jinan Yaoqiang International Airport (TNA) with domestic and international flights",
      "By Train: High-speed rail connects Jinan to Beijing, Shanghai, and major cities",
      "By Bus: Long-distance bus services from neighboring provinces"
    ],
    "gettingAround": [
      "Bus: Comprehensive public bus system",
      "Taxi: Available for convenient travel",
      "Metro: Modern subway system connecting major areas",
      "Walking: Best way to explore spring areas and historic districts"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Springs and Lakes",
      "activities": [
        "Morning: Visit Baotu Spring Park, the most famous spring in Jinan",
        "Afternoon: Explore Daming Lake and its scenic surroundings",
        "Evening: Walk along the ancient city moat"
      ]
    },
    {
      "day": "Day 2: Cultural Heritage",
      "activities": [
        "Morning: Climb Thousand Buddha Mountain for city views",
        "Afternoon: Visit Lingyan Temple and other historic sites",
        "Evening: Enjoy traditional Shandong cuisine at local restaurants"
      ]
    },
    {
      "day": "Day 3: Local Experience",
      "activities": [
        "Morning: Explore local markets and spring areas",
        "Afternoon: Visit museums and cultural centers",
        "Evening: Experience Jinan's night life and food streets"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/jinan_1_optimized.jpg",
    "../images/user_photos/jinan_2_optimized.jpg",
    "../images/user_photos/jinan_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "SHANDONG UNIVERSITY"
    },
    {
      "number": "CN117111124A",
      "title": "Heavy-duty truck engine emission control",
      "assignee": "SINOTRUK JINAN TRUCK CO., LTD."
    },
    {
      "number": "CN116222235A",
      "title": "Spring water quality protection and monitoring",
      "assignee": "JINAN ENVIRONMENTAL PROTECTION BUREAU"
    },
    {
      "number": "CN115333346A",
      "title": "High-speed rail bearing manufacturing method",
      "assignee": "CRRC JINAN CO., LTD."
    },
    {
      "number": "CN117444457A",
      "title": "Laser cutting machine for metal processing",
      "assignee": "JINAN HANLASER TECHNOLOGY CO., LTD."
    },
    {
      "number": "CN116555568A",
      "title": "Traditional Shandong cuisine preservation method",
      "assignee": "JINAN UNIVERSITY"
    },
    {
      "number": "CN115666679A",
      "title": "Biopharmaceutical fermentation process",
      "assignee": "JINAN QILU PHARMACEUTICAL CO., LTD."
    },
    {
      "number": "CN117777790A",
      "title": "Smart grid energy storage system",
      "assignee": "STATE GRID SHANDONG ELECTRIC POWER COMPANY"
    },
    {
      "number": "CN116888889A",
      "title": "Industrial robot precision control system",
      "assignee": "JINAN INSPUR INTELLIGENT TECHNOLOGY CO., LTD."
    },
    {
      "number": "CN116000000A",
      "title": "Ancient spring landscape preservation technology",
      "assignee": "JINAN CULTURAL HERITAGE PROTECTION CENTER"
    }
  ]
}