{
  "name": "Kaifeng",
  "title": "Kaifeng - Traveling China like your home yard",
  "heroTitle": "Kaifeng",
  "heroSubtitle": "Ancient Capital of Seven Dynasties",
  "heroImage": "../images/user_photos/kaifeng_hero_bg.jpg",
  "overview": "Kaifeng, one of China's most historically significant cities, served as the capital of seven different dynasties and was once the largest city in the world during the Northern Song Dynasty (960-1127 AD). Located in eastern Henan province along the southern banks of the Yellow River, Kaifeng was known as Dongjing (Eastern Capital) during its golden age, when its population exceeded one million people and it became the political, economic, and cultural center of China. The city's strategic location at the intersection of major trade routes made it a thriving metropolis where merchants from across Asia converged, creating a cosmopolitan atmosphere that rivaled any city of its time. The city's golden age during the Northern Song Dynasty represents one of the most sophisticated periods in Chinese urban development. Kaifeng was the first Chinese capital to break free from the rigid grid pattern of earlier cities, developing organically along the Yellow River with a more natural layout. The famous painting 'Along the River During the Qingming Festival' by Zhang Zeduan depicts the bustling commercial activity of Kaifeng during this period, showing crowded markets, busy docks, and elaborate architecture that demonstrated the city's prosperity. Today, Kaifeng preserves its rich heritage through numerous historical sites that transport visitors back to imperial China. The Iron Pagoda, built in 1049 AD, stands as one of China's oldest and best-preserved Buddhist towers, its glazed bricks still displaying vibrant colors after nearly a millennium. The Daxiangguo Temple, once the largest Buddhist monastery in the empire, continues to attract worshippers and tourists alike. Kaifeng also holds a unique place in Jewish history as the site of one of the oldest Jewish communities in China, with a Jewish Quarter that existed for over 700 years. The city's culinary traditions, particularly its soup dumplings and sesame cakes, reflect the sophisticated palate developed during its imperial heyday. Whether exploring the reconstructed Millennium City Park, which recreates Song Dynasty street life, or wandering through the bustling night markets, Kaifeng offers an unparalleled journey into China's glorious past.",
  "highlights": {
    "attractions": "Iron Pagoda, Dragon Pavilion, Qingming Riverside Landscape Garden, Kaifeng Fu (Prefecture), Xiangguo Temple",
    "cuisine": "Kaifeng Roast Duck, Steamed Buns with Filling (Xiaolongbao), Peanut Cake, Stir-fried Buckwheat Noodles",
    "bestTime": "Spring (April-May) and Autumn (September-October) for pleasant weather and cultural festivals."
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Kaifeng Roast Duck",
        "description": "A local specialty, distinct from Beijing Roast Duck, known for its crispy skin and tender meat."
      },
      {
        "name": "Steamed Buns with Filling (Xiaolongbao)",
        "description": "Delicate steamed dumplings, often filled with pork and soup, a staple of Northern Chinese cuisine."
      },
      {
        "name": "Peanut Cake",
        "description": "A traditional snack made from peanuts, sugar, and flour, often pressed into intricate shapes."
      }
    ],
    "foodStreets": [
      {
        "name": "Gulou Square Night Market",
        "description": "Famous for its wide array of local snacks and street food, especially vibrant in the evenings."
      },
      {
        "name": "Shudian Street",
        "description": "Offers a mix of traditional restaurants and modern eateries, known for its historical ambiance."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: The nearest major airport is Zhengzhou Xinzheng International Airport (CGO), about 70 km from Kaifeng. From there, you can take a bus or high-speed train to Kaifeng.",
      "By Train: Kaifeng has a high-speed railway station with connections to major cities like Zhengzhou, Beijing, Shanghai, and Xi'an.",
      "By Bus: Long-distance bus services connect Kaifeng with various cities in Henan Province and neighboring regions."
    ],
    "gettingAround": [
      "Public Bus: An extensive bus network covers most of the city's attractions.",
      "Taxi/Didi: Readily available for convenient travel.",
      "Bicycle: Renting a bicycle is a popular way to explore the ancient city walls and historical areas.",
      "Walking: Many historical sites in the city center are within walking distance of each other."
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Song Dynasty Grandeur",
      "activities": [
        "Morning: Visit the Qingming Riverside Landscape Garden, a large-scale theme park recreating the Song Dynasty capital.",
        "Afternoon: Explore the Dragon Pavilion (Longting Park), the site of former imperial palaces, and the Kaifeng Fu (Prefecture).",
        "Evening: Enjoy the vibrant Gulou Square Night Market for local street food and cultural performances."
      ]
    },
    {
      "day": "Day 2: Ancient Temples and Pagodas",
      "activities": [
        "Morning: Discover the Iron Pagoda (Youguo Temple), a magnificent 13-story pagoda built in 1049.",
        "Afternoon: Visit Xiangguo Temple, a historic Buddhist monastery with a rich legacy.",
        "Evening: Stroll along the ancient city walls or enjoy a traditional Henan opera performance."
      ]
    },
    {
      "day": "Day 3: Cultural Immersion",
      "activities": [
        "Morning: Explore the Kaifeng Museum to delve deeper into the city's history and cultural artifacts.",
        "Afternoon: Visit the Memorial Temple of Lord Bao, dedicated to a revered Song Dynasty official for his integrity.",
        "Evening: Relax by the lakes or enjoy a local tea ceremony."
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/kaifeng_1.jpg",
    "../images/user_photos/kaifeng_2.jpg",
    "../images/user_photos/kaifeng_3.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "KAIFENG UNIVERSITY"
    },
    {
      "number": "CN117111125A",
      "title": "Ancient city wall structural monitoring system",
      "assignee": "KAIFENG CULTURAL HERITAGE RESEARCH INSTITUTE"
    },
    {
      "number": "CN116222236A",
      "title": "Traditional Kaifeng snack automated production",
      "assignee": "KAIFENG FOOD INDUSTRY CO., LTD."
    },
    {
      "number": "CN115333347A",
      "title": "Song Dynasty cultural relic preservation method",
      "assignee": "KAIFENG MUSEUM"
    },
    {
      "number": "CN117444458A",
      "title": "Agricultural irrigation system for Yellow River basin",
      "assignee": "HENAN UNIVERSITY KAIFENG CAMPUS"
    },
    {
      "number": "CN116555569A",
      "title": "Traditional Chinese medicine for respiratory health",
      "assignee": "KAIFENG HOSPITAL OF TRADITIONAL CHINESE MEDICINE"
    },
    {
      "number": "CN115666680A",
      "title": "Historic garden landscape restoration technology",
      "assignee": "KAIFENG PARK MANAGEMENT BUREAU"
    },
    {
      "number": "CN117777791A",
      "title": "Smart tourism navigation for ancient capital",
      "assignee": "KAIFENG TOURISM GROUP CO., LTD."
    },
    {
      "number": "CN116888890A",
      "title": "Underground archaeological site protection system",
      "assignee": "KAIFENG INSTITUTE OF ARCHAEOLOGY"
    },
    {
      "number": "CN116000001A",
      "title": "Traditional opera costume digital preservation",
      "assignee": "KAIFENG CULTURAL CENTER"
    }
  ]
}