{
  "name": "Kashi",
  "title": "Kashi - Traveling China like your home yard",
  "heroTitle": "Kashi",
  "heroSubtitle": "Ancient Silk Road Oasis",
  "heroImage": "../images/user_photos/kashi_hero_bg.jpg",
  "overview": "Kashgar (Kashi) stands at the crossroads of civilizations, a legendary oasis city that has served as the meeting point of East and West for over two millennia. Located in the westernmost corner of China, near the borders with Kyrgyzstan and Tajikistan, this city of 700,000 people has been the pivot point of the Silk Road since before recorded history. Caravans from China, India, Persia, and Rome once converged here, exchanging not just goods but ideas, religions, languages, and cultures that shaped the course of human civilization. Today, Kashgar remains the most important city in China's Xinjiang region and the gateway to Central Asia. The city's soul is unmistakably Uyghur, a Turkic Muslim people whose culture dominates every aspect of life here. The sound of the call to prayer echoes from minarets five times daily, mixing with the bustle of markets and the aroma of roasting lamb. The Id Kah Mosque, the largest in China, anchors the city center with its distinctive yellow-tiled facade and can accommodate up to 20,000 worshippers. Around it, the labyrinthine alleys of the Old City preserve traditional Uyghur architecture—mud-brick houses with carved wooden doors and courtyards shaded by grape arbors—though much has been rebuilt in recent years. The Sunday Market, reputedly the largest bazaar in Central Asia, transforms the city into a riot of color and commerce, with traders from across the region selling everything from silk and carpets to livestock and traditional medicines. Kashgar's location at the edge of the Taklamakan Desert and the foot of the Pamir Mountains has made it a natural gathering point for travelers and traders throughout history. The city marks the point where the northern and southern routes of the Silk Road converged before continuing westward over the mountains. This strategic position has given Kashgar a cosmopolitan character unlike any other Chinese city. The cuisine reflects this heritage with Central Asian influences—hand-pulled laghman noodles, aromatic pilaf cooked with carrots and raisins, and succulent lamb kebabs seasoned with cumin and chili. Whether you're exploring the ancient streets, haggling in the bazaar, or watching the sunset paint the mountains gold, Kashgar offers an unforgettable glimpse into a world where the Silk Road still lives and breathes.",
  "highlights": {
    "attractions": "Id Kah Mosque, Kashgar Old Town, Sunday Bazaar, Abakh Khoja Tomb",
    "cuisine": "Uyghur Polo, Kebabs, Naan Bread, Hand-pulled Noodles, Dried Fruits",
    "bestTime": "Spring (April-May) and Autumn (September-October) with mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Uyghur Polo",
        "description": "Traditional Uyghur rice pilaf with lamb, carrots, and aromatic spices."
      },
      {
        "name": "Lamb Kebabs",
        "description": "Tender lamb skewers grilled over charcoal with cumin and spices."
      },
      {
        "name": "Uyghur Naan",
        "description": "Traditional flatbread baked in clay ovens, perfect with kebabs."
      }
    ],
    "foodStreets": [
      {
        "name": "Kashgar Night Market",
        "description": "Vibrant night market with Uyghur specialties and street food."
      },
      {
        "name": "Old Town Food Area",
        "description": "Traditional Uyghur restaurants in the historic old town."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Kashgar Airport (KHG) with domestic flights from major Chinese cities",
      "By Train: Railway connects Kashgar to Urumqi and other Xinjiang cities",
      "By Bus: Long-distance bus services from neighboring regions"
    ],
    "gettingAround": [
      "Taxi: Available for convenient travel within the city",
      "Bus: Local bus system connecting major areas",
      "Walking: Best way to explore the old town and bazaars",
      "Donkey Cart: Traditional transportation in rural areas"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Old Town Exploration",
      "activities": [
        "Morning: Explore Kashgar Old Town with traditional Uyghur architecture",
        "Afternoon: Visit Id Kah Mosque, the largest mosque in China",
        "Evening: Experience the vibrant night market"
      ]
    },
    {
      "day": "Day 2: Cultural Heritage",
      "activities": [
        "Morning: Visit Abakh Khoja Tomb and learn about Islamic architecture",
        "Afternoon: Explore the Sunday Bazaar (if it's Sunday)",
        "Evening: Enjoy traditional Uyghur music and dance"
      ]
    },
    {
      "day": "Day 3: Local Experience",
      "activities": [
        "Morning: Visit local workshops and craft centers",
        "Afternoon: Explore traditional bazaars and try local cuisine",
        "Evening: Experience Uyghur hospitality and culture"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/kashi_1_optimized.jpg",
    "../images/user_photos/kashi_2_optimized.jpg",
    "../images/user_photos/kashi_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "KASHGAR UNIVERSITY"
    },
    {
      "number": "CN117111126A",
      "title": "Desert agriculture drip irrigation system",
      "assignee": "KASHGAR ACADEMY OF AGRICULTURAL SCIENCES"
    },
    {
      "number": "CN116222237A",
      "title": "Uyghur traditional craft preservation method",
      "assignee": "KASHGAR UNIVERSITY"
    },
    {
      "number": "CN115333348A",
      "title": "Border trade logistics optimization system",
      "assignee": "KASHGAR ECONOMIC DEVELOPMENT ZONE"
    },
    {
      "number": "CN117444459A",
      "title": "Solar energy system for arid regions",
      "assignee": "KASHGAR POWER SUPPLY BUREAU"
    },
    {
      "number": "CN116555570A",
      "title": "Ancient city architecture restoration technology",
      "assignee": "KASHGAR CULTURAL HERITAGE PROTECTION CENTER"
    },
    {
      "number": "CN115666681A",
      "title": "Traditional dried fruit processing method",
      "assignee": "KASHGAR FOOD PROCESSING CO., LTD."
    },
    {
      "number": "CN117777792A",
      "title": "Ethnic textile digital design system",
      "assignee": "KASHGAR ARTS AND CRAFTS RESEARCH INSTITUTE"
    },
    {
      "number": "CN116888891A",
      "title": "Desert highway windbreak protection system",
      "assignee": "KASHGAR TRANSPORTATION BUREAU"
    },
    {
      "number": "CN116000002A",
      "title": "Groundwater extraction and purification system",
      "assignee": "KASHGAR WATER CONSERVANCY BUREAU"
    }
  ]
}