{
  "name": "Kunming",
  "title": "Kunming - Traveling China like your home yard",
  "heroTitle": "Kunming",
  "heroSubtitle": "City of Eternal Spring",
  "heroImage": "../images/user_photos/kunming_hero_bg.jpg",
  "overview": "Kunming, the capital of Yunnan Province, has earned its nickname 'City of Eternal Spring' through a remarkable climate that maintains mild temperatures year-round, with averages between 15-25°C regardless of season. Situated on the Yunnan-Guizhou Plateau at an elevation of 1,900 meters, this city of 8 million people serves as the political, economic, and cultural center of one of China's most diverse and fascinating provinces. The pleasant weather, blooming flowers, and abundant sunshine have made Kunming a destination of choice for travelers seeking respite from China's harsh winters and sweltering summers. Yunnan's reputation as the most ethnically diverse province in China finds its expression in Kunming, where 26 of China's 56 recognized ethnic minorities maintain vibrant communities. The city functions as a living museum of cultural diversity, with distinct neighborhoods showcasing the traditions, cuisines, and crafts of the Yi, Bai, Hani, Zhuang, and Dai peoples, among others. This multicultural tapestry is celebrated annually at events like the Third Month Fair and the Torch Festival, when the city streets fill with colorful costumes, traditional music, and ethnic dance performances that attract visitors from across China and beyond. Kunming's role as a gateway to Yunnan's natural wonders has shaped its development as a tourist hub. The nearby Stone Forest, a UNESCO World Heritage Site, presents a surreal landscape of limestone pillars that resemble a petrified forest, created over 270 million years of geological activity. Dianchi Lake, one of China's largest freshwater lakes, provides scenic waterfront recreation within the city limits, while the Western Hills offer hiking trails with panoramic views. The city's botanical gardens, including the world-renowned Kunming Institute of Botany, showcase Yunnan's extraordinary plant diversity—over 18,000 species of higher plants, more than any other province in China. Whether you're sampling the famous Crossing-the-Bridge Noodles, exploring the bustling Bird and Flower Market, or using Kunming as a base for adventures to Dali, Lijiang, and Xishuangbanna, this spring city offers a perfect introduction to the wonders of Yunnan.",
  "highlights": {
    "attractions": "Stone Forest, Dianchi Lake, Green Lake Park, Yuantong Temple, Western Hills",
    "cuisine": "Cross-bridge Rice Noodles, Steam Pot Chicken, Yunnan Ham, Wild Mushrooms",
    "bestTime": "Year-round destination with mild climate, best in Spring and Autumn"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Cross-bridge Rice Noodles",
        "description": "Famous Yunnan dish with rice noodles in rich broth, served with various toppings."
      },
      {
        "name": "Steam Pot Chicken",
        "description": "Traditional chicken soup steamed in special pottery with herbs."
      },
      {
        "name": "Yunnan Ham",
        "description": "Famous cured ham from Yunnan, used in various local dishes."
      }
    ],
    "foodStreets": [
      {
        "name": "Nanping Street",
        "description": "Popular food street with local specialties and snacks."
      },
      {
        "name": "Green Lake Area",
        "description": "Restaurants and cafes around the scenic lake area."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Kunming Changshui International Airport (KMG) with domestic and international flights",
      "By Train: High-speed rail connects Kunming to major cities including Beijing and Shanghai",
      "By Bus: Long-distance bus services from neighboring provinces"
    ],
    "gettingAround": [
      "Metro: Modern subway system connecting major areas",
      "Bus: Comprehensive public bus network",
      "Taxi: Available for convenient travel",
      "Bicycle: Popular for exploring parks and scenic areas"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: City Exploration",
      "activities": [
        "Morning: Visit Green Lake Park and enjoy the scenery",
        "Afternoon: Explore Yuantong Temple and nearby areas",
        "Evening: Walk around Nanping Street and try local food"
      ]
    },
    {
      "day": "Day 2: Natural Wonders",
      "activities": [
        "Morning: Visit the famous Stone Forest (Shilin)",
        "Afternoon: Explore Dianchi Lake area",
        "Evening: Return to city and enjoy local cuisine"
      ]
    },
    {
      "day": "Day 3: Cultural Experience",
      "activities": [
        "Morning: Visit Western Hills and Dragon Gate",
        "Afternoon: Explore local markets and ethnic minority areas",
        "Evening: Experience Kunming's night life and food culture"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/kunming_1_optimized.jpg",
    "../images/user_photos/kunming_2_optimized.jpg",
    "../images/user_photos/kunming_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "YUNNAN UNIVERSITY"
    },
    {
      "number": "CN117111127A",
      "title": "Highland flower cultivation greenhouse system",
      "assignee": "KUNMING INSTITUTE OF BOTANY"
    },
    {
      "number": "CN116222238A",
      "title": "Dianchi Lake water quality restoration method",
      "assignee": "KUNMING ENVIRONMENTAL PROTECTION BUREAU"
    },
    {
      "number": "CN115333349A",
      "title": "Ethnic minority medicinal plant extraction",
      "assignee": "KUNMING MEDICAL UNIVERSITY"
    },
    {
      "number": "CN117444460A",
      "title": "Tobacco leaf processing quality control system",
      "assignee": "KUNMING CIGARETTE FACTORY"
    },
    {
      "number": "CN116555571A",
      "title": "High-speed rail tunnel ventilation system",
      "assignee": "KUNMING RAILWAY CONSTRUCTION GROUP"
    },
    {
      "number": "CN115666682A",
      "title": "Tourism scenic area ecological protection",
      "assignee": "KUNMING TOURISM GROUP CO., LTD."
    },
    {
      "number": "CN117777793A",
      "title": "Stone forest geological monitoring system",
      "assignee": "KUNMING INSTITUTE OF GEOLOGY"
    },
    {
      "number": "CN116888892A",
      "title": "Cross-border trade logistics platform",
      "assignee": "KUNMING ECONOMIC DEVELOPMENT ZONE"
    },
    {
      "number": "CN116000003A",
      "title": "Plateau agriculture smart irrigation",
      "assignee": "KUNMING ACADEMY OF AGRICULTURAL SCIENCES"
    }
  ]
}