
{
  "name": "Linyi",
  "title": "Linyi - Traveling China",
  "heroTitle": "Discover Linyi",
  "heroSubtitle": "A prefecture-level city in southern Shandong province, is a place where ancient history and modern dynamism converge.",
  "heroImage": "../images/user_photos/linyi_hero_bg.jpg",
  "overview": "Linyi, situated in the southeast of Shandong Province, holds a special place in Chinese cultural history as the birthplace of Wang Xizhi, the revered 'Sage of Calligraphy' whose works have influenced Chinese art for over 1,600 years. This city of 11 million people, situated along the Yi River, has transformed from an ancient cultural center into one of China's most dynamic commercial hubs while carefully preserving its artistic heritage. The connection between Linyi and calligraphy runs so deep that the city hosts the annual China Linyi Calligraphy Culture Festival, drawing artists and scholars from across Asia to celebrate this most Chinese of art forms. The legacy of Wang Xizhi permeates Linyi's cultural landscape. The Wang Xizhi's Former Residence and the nearby Jin Dynasty tombs with their brick murals offer tangible connections to the era when Chinese calligraphy achieved its classical form. The city's museums house precious collections of rubbings and original works that document the evolution of Chinese writing from practical communication to high art. This cultural depth contrasts fascinatingly with Linyi's modern identity as one of China's largest logistics and wholesale trade centers, where massive markets distribute goods throughout the country and beyond. Beyond its cultural and commercial significance, Linyi offers natural beauty in the form of the Mengshan Mountain National Forest Park, known locally as a 'natural oxygen bar' for its pristine air and lush vegetation. The Yi River, which has flowed through Linyi for millennia, provides scenic waterfronts where residents gather for evening strolls and traditional exercise. The city's cuisine reflects its Shandong location with hearty wheat-based dishes and fresh river fish. Whether you're exploring the calligraphy museums, experiencing the energy of the wholesale markets, or hiking in the surrounding mountains, Linyi offers a unique blend of high culture and down-to-earth commerce that represents modern China in microcosm.",
  "highlights": {
    "attractions": "Wang Xizhi's Former Residence, Mengshan Mountain National Forest Park, Linyi Trade City",
    "cuisine": "Shandong Pancake (Jianbing), Braised Pork in Brown Sauce, Linyi Pancake",
    "bestTime": "Spring and Autumn"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Shandong Pancake (Jianbing)",
        "description": "A savory crepe made from grain flour, often filled with egg, crispy crackers, and scallions."
      },
      {
        "name": "Braised Pork in Brown Sauce",
        "description": "A classic Chinese dish, slow-cooked to perfection with a rich, savory, and slightly sweet flavor."
      }
    ],
    "foodStreets": []
  },
  "transportation": {
    "gettingThere": [
      "By Air: Linyi Shubuling Airport (LYI) connects the city to major domestic destinations."
    ],
    "gettingAround": [
      "By Train: High-speed and conventional trains link Linyi to the national rail network.",
      "Public Transit: An extensive bus system makes it easy and affordable to travel within the city."
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Cultural Immersion",
      "activities": [
        "Morning: Wang Xizhi's Former Residence",
        "Afternoon: Linyi Museum"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/linyi_1_optimized.jpg",
    "../images/user_photos/linyi_2_optimized.jpg",
    "../images/user_photos/linyi_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN113325699A",
      "title": "A kind of environment-friendly high-elasticity flame-retardant artificial leather and preparation method thereof",
      "assignee": "Liu, Wei"
    },
    {
      "number": "CN113278688A",
      "title": "A kind of wear-resistant and scratch-resistant solvent-free PU artificial leather and preparation method thereof",
      "assignee": "Wang, Jian"
    },
    {
      "number": "CN113122021A",
      "title": "A kind of antibacterial and mildewproof PU synthetic leather and preparation method thereof",
      "assignee": "Li, Na"
    },
    {
      "number": "CN117111128A",
      "title": "Logistics park automated warehousing system",
      "assignee": "LINYI LOGISTICS GROUP CO., LTD."
    },
    {
      "number": "CN116222239A",
      "title": "Hardware manufacturing precision casting method",
      "assignee": "LINYI HARDWARE INDUSTRY CO., LTD."
    },
    {
      "number": "CN115333350A",
      "title": "Yimeng Mountain tourism smart guide system",
      "assignee": "LINYI TOURISM BUREAU"
    },
    {
      "number": "CN117444461A",
      "title": "Traditional Chinese medicine herb cultivation",
      "assignee": "LINYI UNIVERSITY OF TRADITIONAL CHINESE MEDICINE"
    },
    {
      "number": "CN116555572A",
      "title": "E-commerce agricultural product traceability",
      "assignee": "LINYI E-COMMERCE INDUSTRY PARK"
    },
    {
      "number": "CN115666683A",
      "title": "Textile dyeing wastewater treatment",
      "assignee": "LINYI ENVIRONMENTAL PROTECTION TECHNOLOGY CO., LTD."
    },
    {
      "number": "CN117777794A",
      "title": "Ancient battlefield site preservation",
      "assignee": "LINYI CULTURAL HERITAGE PROTECTION CENTER"
    }
  ]
}
