{
  "name": "Nanjing",
  "title": "Nanjing - Traveling China like your home yard",
  "heroTitle": "Nanjing",
  "heroSubtitle": "Ancient Capital & Modern City",
  "heroImage": "../images/user_photos/nanjing_hero_bg.jpg",
  "overview": "Nanjing, whose name literally means 'Southern Capital,' stands as one of China's most historically significant cities, having served as the capital for ten dynasties and multiple republican governments. This rich political heritage has earned it a reputation as one of the Four Great Ancient Capitals of China, alongside Beijing, Xi'an, and Luoyang. Situated on the southern bank of the Yangtze River, surrounded by the Zijin Mountain (Purple Mountain) and blessed with the scenic Xuanwu Lake, Nanjing's geography has always provided both strategic military advantage and natural beauty, making it a coveted seat of power throughout Chinese history. The city's history is a tapestry of glory and tragedy, of imperial splendor and wartime devastation. Nanjing was the capital during the early Ming Dynasty, when the Emperor Zhu Di commissioned the construction of the magnificent city wall that still stands today — one of the longest and best-preserved ancient city walls in the world. In the 19th century, it served as the capital of the Taiping Heavenly Kingdom and later the Republic of China. The city also bears the scars of the Nanjing Massacre of 1937, and the Memorial Hall to the Victims serves as a solemn reminder of this dark chapter while promoting peace and reconciliation. Today, Nanjing has transformed into a vibrant modern metropolis while carefully preserving its historical treasures. The city is renowned for its educational institutions, including Nanjing University, one of China's most prestigious universities, which contributes to a youthful, intellectual atmosphere. The city's cultural heritage is evident in its traditional Yunjin brocade, a UNESCO-recognized intangible cultural heritage, and its distinctive cuisine that emphasizes fresh, seasonal ingredients from the Jiangnan region. Whether you're walking the ancient city walls at sunset, paying respects at the Sun Yat-sen Mausoleum, or exploring the lively Confucius Temple district, Nanjing offers a profound journey through the layers of Chinese civilization.",
  "highlights": {
    "attractions": "Purple Mountain, Sun Yat-sen Mausoleum, Presidential Palace, Confucius Temple",
    "cuisine": "Nanjing Salted Duck, Duck Blood Soup, Steamed Dumplings, Osmanthus Duck",
    "bestTime": "Spring (March-May) and Autumn (September-November) with mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Nanjing Salted Duck",
        "description": "Famous local specialty with tender duck meat and unique seasoning."
      },
      {
        "name": "Duck Blood Soup",
        "description": "Traditional soup with duck blood, tofu, and vermicelli in rich broth."
      },
      {
        "name": "Nanjing Steamed Dumplings",
        "description": "Delicate dumplings with thin wrappers and savory fillings."
      }
    ],
    "foodStreets": [
      {
        "name": "Confucius Temple Area",
        "description": "Historic area with traditional Nanjing cuisine and snacks."
      },
      {
        "name": "Laomendong",
        "description": "Restored historic district with local restaurants and tea houses."
      }
    ],
    "signature_dishes": [
      {
        "name": "Salted Duck (盐水鸭)",
        "description": "Cold poached duck with subtle salt flavor"
      },
      {
        "name": "Duck Blood Soup (鸭血粉丝汤)",
        "description": "Vermicelli soup with duck blood and organs"
      },
      {
        "name": "Lion's Head Meatballs (狮子头)",
        "description": "Large pork meatballs with vegetables"
      },
      {
        "name": "Nanjing Roast Duck (南京烤鸭)",
        "description": "Crispy duck with sweet bean sauce"
      },
      {
        "name": "Tofu Dumplings (豆腐涝)",
        "description": "Soft tofu with savory toppings"
      }
    ],
    "street_food": [
      "Salted Duck",
      "Sesame Pancake",
      "Tofu Dumplings",
      "Sugar Porridge"
    ],
    "famous_restaurants": [
      "De Ji",
      "Ma Xiang Xing",
      "Liu Feng Ju"
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Nanjing Lukou International Airport (NKG) with domestic and international flights",
      "By Train: High-speed rail connects Nanjing to major cities including Beijing and Shanghai",
      "By Bus: Long-distance bus services from neighboring provinces"
    ],
    "gettingAround": [
      "Metro: Modern subway system connecting major areas",
      "Bus: Comprehensive public bus network",
      "Taxi: Available for convenient travel",
      "Walking: Best way to explore historic districts"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Historic Sites",
      "activities": [
        "Morning: Visit Sun Yat-sen Mausoleum on Purple Mountain",
        "Afternoon: Explore Ming Xiaoling Mausoleum and surrounding area",
        "Evening: Walk around Xuanwu Lake scenic area"
      ]
    },
    {
      "day": "Day 2: Cultural Heritage",
      "activities": [
        "Morning: Visit Presidential Palace and learn about modern Chinese history",
        "Afternoon: Explore Confucius Temple area and Qinhuai River",
        "Evening: Enjoy traditional Nanjing cuisine at local restaurants"
      ]
    },
    {
      "day": "Day 3: Museums and Memorials",
      "activities": [
        "Morning: Visit Memorial Hall of the Nanjing Massacre",
        "Afternoon: Explore Nanjing Museum and other cultural sites",
        "Evening: Experience local culture and night markets"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/nanjing_1_optimized.jpg",
    "../images/user_photos/nanjing_2_optimized.jpg",
    "../images/user_photos/nanjing_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "NANJING UNIVERSITY OF TECHNOLOGY"
    },
    {
      "number": "CN117111113A",
      "title": "High-speed rail wheel material with enhanced durability",
      "assignee": "CRRC NANJING PUZHEN CO., LTD."
    },
    {
      "number": "CN116222224A",
      "title": "Yunjin brocade weaving automation system",
      "assignee": "NANJING YUNJIN RESEARCH INSTITUTE"
    },
    {
      "number": "CN115333335A",
      "title": "Smart grid energy storage with lithium-ion batteries",
      "assignee": "STATE GRID JIANGSU ELECTRIC POWER COMPANY"
    },
    {
      "number": "CN117444446A",
      "title": "Aerospace composite material for satellite structures",
      "assignee": "NANJING UNIVERSITY OF AERONAUTICS AND ASTRONAUTICS"
    },
    {
      "number": "CN116555557A",
      "title": "Chemical synthesis method for pharmaceutical intermediates",
      "assignee": "NANJING PHARMACEUTICAL GROUP CO., LTD."
    },
    {
      "number": "CN115666668A",
      "title": "Historical document preservation using nanomaterials",
      "assignee": "NANJING MUSEUM CONSERVATION CENTER"
    },
    {
      "number": "CN117777779A",
      "title": "Port container crane automation system",
      "assignee": "NANJING PORT GROUP CO., LTD."
    },
    {
      "number": "CN116888880A",
      "title": "Environmental monitoring drone for Yangtze River",
      "assignee": "NANJING UNIVERSITY OF INFORMATION SCIENCE AND TECHNOLOGY"
    },
    {
      "number": "CN115999991A",
      "title": "Quantum communication relay station apparatus",
      "assignee": "NANJING INSTITUTE OF QUANTUM INFORMATION TECHNOLOGY"
    }
  ]
}