{
  "name": "Shanghai",
  "title": "Shanghai - Traveling China like your home yard",
  "heroTitle": "Shanghai",
  "heroSubtitle": "The Pearl of the Orient",
  "heroImage": "../images/user_photos/shanghai_hero_bg.jpg",
  "overview": "Shanghai is China's largest city and global financial hub, where East meets West in a stunning blend of colonial architecture and futuristic skyscrapers. From the historic Bund waterfront to the cutting-edge skyline of Pudong, Shanghai offers an exciting mix of traditional culture, world-class dining, and vibrant nightlife.",
  "highlights": {
    "attractions": "The Bund, Yu Garden, Oriental Pearl Tower, Nanjing Road, Xintiandi",
    "cuisine": "Xiaolongbao, Shengjianbao, Scallion Oil Noodles, Sweet and Sour Ribs",
    "bestTime": "Spring (March-May) and Autumn (September-November) for mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Xiaolongbao",
        "description": "Delicate soup dumplings with pork filling, steamed in bamboo baskets."
      },
      {
        "name": "Shengjianbao",
        "description": "Pan-fried pork buns with crispy bottom and juicy filling."
      },
      {
        "name": "Scallion Oil Noodles",
        "description": "Simple but flavorful noodles tossed with fragrant scallion oil."
      }
    ],
    "foodStreets": [
      {
        "name": "City God Temple (Chenghuangmiao)",
        "description": "Traditional snack street with century-old shops and local delicacies."
      },
      {
        "name": "Wujiang Road",
        "description": "Pedestrian food street with both traditional and modern eateries."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Shanghai Pudong International Airport (PVG) and Shanghai Hongqiao (SHA)",
      "By Train: High-speed rail connects Shanghai to Beijing, Nanjing, Hangzhou",
      "By Bus: Long-distance buses from nearby cities and provinces"
    ],
    "gettingAround": [
      "Metro: World's longest metro system, efficient and affordable",
      "Bus: Extensive bus network covering all districts",
      "Maglev: World's fastest commercial train from Pudong Airport",
      "Huangpu River Ferry: Scenic transportation between Puxi and Pudong"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Historic Shanghai",
      "activities": [
        "Morning: Walk along the Bund waterfront for colonial architecture views",
        "Afternoon: Explore Yu Garden and traditional bazaar area",
        "Evening: Nanjing Road pedestrian street for shopping and dining"
      ]
    },
    {
      "day": "Day 2: Modern Shanghai",
      "activities": [
        "Morning: Visit Oriental Pearl Tower or Shanghai Tower observation deck",
        "Afternoon: Explore Xintiandi for shopping and French Concession area",
        "Evening: Huangpu River cruise for illuminated skyline views"
      ]
    },
    {
      "day": "Day 3: Culture & Gardens",
      "activities": [
        "Morning: Jade Buddha Temple or Longhua Temple",
        "Afternoon: Shanghai Museum for ancient Chinese art and artifacts",
        "Evening: Traditional acrobatics show or jazz bar in French Concession"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/shanghai_1_optimized.jpg",
    "../images/user_photos/shanghai_2_optimized.jpg",
    "../images/user_photos/shanghai_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "SHANGHAI INSTITUTE OF TECHNOLOGY"
    }
  ]
}