{
  "name": "Shanghai",
  "title": "Shanghai - Traveling China like your home yard",
  "heroTitle": "Shanghai",
  "heroSubtitle": "The Pearl of the Orient",
  "heroImage": "../images/user_photos/shanghai_hero_bg.jpg",
  "overview": "Shanghai stands as China's most cosmopolitan metropolis, a dazzling showcase of the nation's rapid transformation from ancient empire to global superpower. With a population exceeding 26 million, this megacity pulses with an energy that few places on Earth can match. The Huangpu River, which flows through the heart of Shanghai, serves as both a physical and symbolic dividing line between the city's two distinct personalities: Puxi, the historic west bank where colonial-era architecture lines the famous Bund, and Pudong, the futuristic east bank dominated by the soaring towers of China's financial district, including the Shanghai Tower, the world's second-tallest building. The city's history as a treaty port following the Opium Wars left an indelible mark on its character, creating a unique cultural blend that sets Shanghai apart from other Chinese cities. The Bund, with its collection of Art Deco and Neoclassical buildings, stands as a testament to Shanghai's former status as the 'Paris of the East,' while the nearby French Concession enchants visitors with its tree-lined avenues, boutique shops, and sidewalk cafes that evoke a distinctly European atmosphere. Yet, just blocks away, traditional shikumen lane houses and bustling wet markets remind visitors that this is still very much a Chinese city, where ancient traditions persist amidst the ultramodern skyline. Shanghai's culinary scene is equally impressive, offering everything from humble street food to Michelin-starred fine dining. The city is the birthplace of xiaolongbao, the delicate soup dumplings that have conquered taste buds worldwide, and shengjianbao, their pan-fried cousins with crispy bottoms and juicy interiors. Beyond these famous dishes, Shanghai's food culture reflects its international heritage, with restaurants serving authentic cuisine from every corner of China and beyond. Whether you're exploring the tranquil classical gardens of Yu Yuan, shopping for luxury brands on Nanjing Road, or simply watching the neon lights reflect off the Huangpu River at night, Shanghai offers an intoxicating blend of history, culture, and modernity that leaves an unforgettable impression on every visitor.",
  "highlights": {
    "attractions": "The Bund, Yu Garden, Oriental Pearl Tower, Nanjing Road, Xintiandi",
    "cuisine": "Xiaolongbao, Shengjianbao, Scallion Oil Noodles, Sweet and Sour Ribs",
    "bestTime": "Spring (March-May) and Autumn (September-November) for mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Xiaolongbao",
        "description": "Delicate soup dumplings with pork filling, steamed in bamboo baskets."
      },
      {
        "name": "Shengjianbao",
        "description": "Pan-fried pork buns with crispy bottom and juicy filling."
      },
      {
        "name": "Scallion Oil Noodles",
        "description": "Simple but flavorful noodles tossed with fragrant scallion oil."
      }
    ],
    "foodStreets": [
      {
        "name": "City God Temple (Chenghuangmiao)",
        "description": "Traditional snack street with century-old shops and local delicacies."
      },
      {
        "name": "Wujiang Road",
        "description": "Pedestrian food street with both traditional and modern eateries."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Shanghai Pudong International Airport (PVG) and Shanghai Hongqiao (SHA)",
      "By Train: High-speed rail connects Shanghai to Beijing, Nanjing, Hangzhou",
      "By Bus: Long-distance buses from nearby cities and provinces"
    ],
    "gettingAround": [
      "Metro: World's longest metro system, efficient and affordable",
      "Bus: Extensive bus network covering all districts",
      "Maglev: World's fastest commercial train from Pudong Airport",
      "Huangpu River Ferry: Scenic transportation between Puxi and Pudong"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Historic Shanghai",
      "activities": [
        "Morning: Walk along the Bund waterfront for colonial architecture views",
        "Afternoon: Explore Yu Garden and traditional bazaar area",
        "Evening: Nanjing Road pedestrian street for shopping and dining"
      ]
    },
    {
      "day": "Day 2: Modern Shanghai",
      "activities": [
        "Morning: Visit Oriental Pearl Tower or Shanghai Tower observation deck",
        "Afternoon: Explore Xintiandi for shopping and French Concession area",
        "Evening: Huangpu River cruise for illuminated skyline views"
      ]
    },
    {
      "day": "Day 3: Culture & Gardens",
      "activities": [
        "Morning: Jade Buddha Temple or Longhua Temple",
        "Afternoon: Shanghai Museum for ancient Chinese art and artifacts",
        "Evening: Traditional acrobatics show or jazz bar in French Concession"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/shanghai_1_optimized.jpg",
    "../images/user_photos/shanghai_2_optimized.jpg",
    "../images/user_photos/shanghai_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "SHANGHAI INSTITUTE OF TECHNOLOGY"
    },
    {
      "number": "CN116789012A",
      "title": "Semiconductor manufacturing process with advanced lithography",
      "assignee": "SHANGHAI HUALI MICROELECTRONICS CORPORATION"
    },
    {
      "number": "CN115678901A",
      "title": "Electric vehicle battery management system with thermal optimization",
      "assignee": "SAIC MOTOR CORPORATION LIMITED"
    },
    {
      "number": "CN117234567A",
      "title": "Port automation system using AI-powered container scheduling",
      "assignee": "SHANGHAI INTERNATIONAL PORT GROUP CO., LTD."
    },
    {
      "number": "CN116345678A",
      "title": "Financial risk assessment model based on machine learning",
      "assignee": "SHANGHAI PUDONG DEVELOPMENT BANK"
    },
    {
      "number": "CN115456789A",
      "title": "High-speed rail signaling system with 5G communication",
      "assignee": "CRRC SHANGHAI CO., LTD."
    },
    {
      "number": "CN117567890A",
      "title": "Biopharmaceutical synthesis method for antibody drugs",
      "assignee": "SHANGHAI HENGRUI PHARMACEUTICAL CO., LTD."
    },
    {
      "number": "CN116678901A",
      "title": "Smart grid energy storage system with lithium-ion batteries",
      "assignee": "STATE GRID SHANGHAI MUNICIPAL ELECTRIC POWER COMPANY"
    },
    {
      "number": "CN115789012A",
      "title": "Aerospace composite material with carbon fiber reinforcement",
      "assignee": "SHANGHAI ACADEMY OF SPACEFLIGHT TECHNOLOGY"
    },
    {
      "number": "CN117890123A",
      "title": "Underwater tunnel construction method for cross-river transit",
      "assignee": "SHANGHAI TUNNEL ENGINEERING CO., LTD."
    }
  ]
}