{
  "name": "Tianjin",
  "title": "Tianjin - Traveling China like your home yard",
  "heroTitle": "Tianjin",
  "heroSubtitle": "A port city with a blend of Chinese and Western architecture.",
  "heroImage": "../images/user_photos/tianjin_hero_bg.jpg",
  "overview": "Tianjin stands as one of China's most distinctive cities, a vibrant port metropolis that seamlessly blends European colonial heritage with authentic Chinese culture. Located just 30 minutes from Beijing by high-speed rail, this former treaty port city served as a crucial gateway for foreign trade and diplomacy during the late Qing Dynasty, resulting in a fascinating architectural landscape that features British, French, Italian, German, and Russian influences alongside traditional Chinese structures. The city's strategic position on the Hai River, which flows into the Bohai Sea, has made it one of northern China's most important economic and industrial centers for over a century. The legacy of Tianjin's cosmopolitan past is most evident in the Five Great Avenues (Wudadao) district, where over 2,000 Western-style villas and mansions line tree-shaded streets, creating an atmosphere reminiscent of European capitals. This architectural treasure trove includes Renaissance, Gothic, Baroque, and Art Deco styles, making it one of the best-preserved collections of Western architecture in Asia. Yet, just a short walk away, visitors can explore the Ancient Culture Street, where traditional Qing Dynasty-style buildings house shops selling folk crafts, calligraphy, and local snacks, offering a stark contrast that perfectly encapsulates Tianjin's unique character. Modern Tianjin is equally captivating, with the iconic Tianjin Eye Ferris wheel standing as a symbol of the city's innovative spirit. This 120-meter tall observation wheel, uniquely built on the Yongle Bridge over the Hai River, offers breathtaking views of the city's illuminated skyline at night. The riverfront itself has been transformed into a lively promenade where locals gather for evening strolls, ballroom dancing, and traditional Chinese opera performances. Food lovers will find Tianjin particularly rewarding, as the city is renowned throughout China for its distinctive cuisine, including the world-famous Goubuli steamed buns, crispy Mahua fried dough twists, and the savory Erduoyan fried cakes. Whether you're drawn by its architectural wonders, its culinary delights, or its fascinating history as a crossroads of cultures, Tianjin offers a refreshing alternative to the typical Chinese tourist experience.",
  "highlights": {
    "attractions": "Five Great Avenues, Tianjin Eye, Ancient Culture Street",
    "cuisine": "Goubuli buns, Mahua (fried dough twists), Erduoyan fried cakes",
    "bestTime": "Spring and Autumn, with mild and pleasant weather."
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Goubuli Buns",
        "description": "Famous steamed buns with savory fillings, a Tianjin specialty."
      },
      {
        "name": "Mahua",
        "description": "Fried dough twists, crispy and sweet, perfect for snacking."
      },
      {
        "name": "Erduoyan Fried Cakes",
        "description": "Traditional fried cakes with various fillings."
      }
    ],
    "foodStreets": [
      {
        "name": "Ancient Culture Street",
        "description": "Traditional snacks and local delicacies."
      },
      {
        "name": "Nanshi Food Street",
        "description": "Wide variety of Tianjin specialties."
      },
      {
        "name": "Hai River Banks",
        "description": "Riverside restaurants with beautiful views."
      }
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Tianjin Binhai International Airport (TSN) with domestic and international flights.",
      "By Train: High-speed rail connections from Beijing (30 minutes), Shanghai, and other major cities.",
      "By Car: Well-connected highway system, about 1.5 hours from Beijing."
    ],
    "gettingAround": [
      "Metro: Efficient metro system covering major attractions.",
      "Bus: Extensive bus network throughout the city.",
      "Taxi: Readily available and affordable.",
      "Walking: Many attractions are within walking distance in the city center."
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Historical Tianjin",
      "activities": [
        "Morning: Visit the Five Great Avenues to see European-style architecture.",
        "Afternoon: Explore Ancient Culture Street for traditional crafts and snacks.",
        "Evening: Take a boat ride on the Hai River for beautiful night views."
      ]
    },
    {
      "day": "Day 2: Modern Tianjin",
      "activities": [
        "Morning: Ride the Tianjin Eye Ferris wheel for panoramic city views.",
        "Afternoon: Visit the Tianjin Museum to learn about the city's history.",
        "Evening: Enjoy local cuisine at Nanshi Food Street."
      ]
    },
    {
      "day": "Day 3: Culture and Shopping",
      "activities": [
        "Morning: Visit the Porcelain House, a unique architectural wonder.",
        "Afternoon: Shop at Binjiang Road pedestrian street.",
        "Evening: Experience Tianjin's nightlife in the Italian Style Town."
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/tianjin_1.jpg",
    "../images/user_photos/tianjin_2.jpg",
    "../images/user_photos/tianjin_3.jpg"
  ],
  "patents": [
    {
      "number": "CN100389121C",
      "title": "Preparation method of mometasone furoate intermediate 21-hydroxyl",
      "assignee": "TIANJIN PHARMACEUTICAL INDUSTRY GROUP CORP Ltd"
    },
    {
      "number": "CN101817783A",
      "title": "Method for preparing tolvaptan intermediate",
      "assignee": "Tianjin Taipu Pharmaceutical Science & Technology Development Co Ltd"
    },
    {
      "number": "CN101347621A",
      "title": "A pharmaceutical composition for treating respiratory diseases",
      "assignee": "TIANJIN PHARMACEUTICALS GROUP CORP"
    },
    {
      "number": "CN117111115A",
      "title": "Port automated container handling system with AI scheduling",
      "assignee": "TIANJIN PORT GROUP CO., LTD."
    },
    {
      "number": "CN116222226A",
      "title": "High-speed rail bogie with active suspension control",
      "assignee": "CRRC TIANJIN CO., LTD."
    },
    {
      "number": "CN115333337A",
      "title": "Aerospace titanium alloy casting method",
      "assignee": "TIANJIN INSTITUTE OF AERONAUTICAL MANUFACTURING TECHNOLOGY"
    },
    {
      "number": "CN117444448A",
      "title": "Offshore wind turbine foundation structure",
      "assignee": "TIANJIN OFFSHORE OIL ENGINEERING CO., LTD."
    },
    {
      "number": "CN116555559A",
      "title": "Smart city street lighting with solar power integration",
      "assignee": "TIANJIN NANKAI UNIVERSITY"
    },
    {
      "number": "CN115666670A",
      "title": "Chemical process for desulfurization of industrial waste gas",
      "assignee": "TIANJIN UNIVERSITY"
    },
    {
      "number": "CN117777781A",
      "title": "Underground pipeline inspection robot with ultrasonic sensors",
      "assignee": "TIANJIN POLYTECHNIC UNIVERSITY"
    }
  ]
}