{
  "name": "Wuhan",
  "title": "Wuhan - Traveling China like your home yard",
  "heroTitle": "Wuhan",
  "heroSubtitle": "River City & Cultural Hub",
  "heroImage": "../images/user_photos/wuhan_hero_bg.jpg",
  "overview": "Wuhan, the capital of Hubei Province, stands as one of China's most important strategic and economic centers, a sprawling metropolis of 11 million people located at the confluence of the Yangtze and Han rivers. This unique geographical position has earned Wuhan the nickname 'The Thoroughfare of Nine Provinces,' as it serves as the transportation and commercial hub connecting China's north, south, east, and west. The city is actually an amalgamation of three former cities—Wuchang, Hankou, and Hanyang—each with distinct characters that have blended into a vibrant urban tapestry that drives the economy of central China. The city's history stretches back over 3,500 years, with Wuchang serving as a political and military center while Hankou developed into one of China's most important commercial ports during the Qing Dynasty. This legacy is embodied in the Yellow Crane Tower, Wuhan's most iconic landmark, which has been destroyed and rebuilt multiple times over 1,800 years and inspired countless poets with its commanding views over the Yangtze. The 1911 Wuchang Uprising, which began in Wuhan, sparked the Xinhai Revolution that overthrew imperial rule and established the Republic of China, giving the city a permanent place in modern Chinese history. Today, Wuhan balances its industrial might—it's often called 'the Chicago of China'—with surprising natural beauty and cultural depth. East Lake, the largest urban lake in China, provides 88 square kilometers of scenic parkland within the city limits, while the Wuhan University campus is famous nationwide for its cherry blossoms. The city's cuisine reflects its position between northern and southern China, with the breakfast tradition of 'guozao' offering dozens of options from hot dry noodles to savory dumplings. As a major center for education and research with over 80 universities, Wuhan maintains a youthful, dynamic energy that continues to drive its growth as one of China's emerging first-tier cities.",
  "highlights": {
    "attractions": "Yellow Crane Tower, East Lake, Wuhan University Cherry Blossoms, Yangtze River Bridge",
    "cuisine": "Hot Dry Noodles, Duck Neck, Soup Dumplings, Fish Dishes",
    "bestTime": "Spring (March-April) for cherry blossoms and Autumn (September-November)"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Hot Dry Noodles",
        "description": "Wuhan's most famous dish - chewy noodles with sesame sauce and various toppings."
      },
      {
        "name": "Duck Neck",
        "description": "Spicy braised duck neck, a popular local snack and street food."
      },
      {
        "name": "Wuhan Soup Dumplings",
        "description": "Delicate dumplings with rich broth and savory fillings."
      }
    ],
    "foodStreets": [
      {
        "name": "Hubu Alley",
        "description": "Famous food street with traditional Wuhan snacks and local specialties."
      },
      {
        "name": "Jiqing Street",
        "description": "Popular night market area with street food and local cuisine."
      }
    ],
    "signature_dishes": [
      {
        "name": "Hot Dry Noodles (热干面)",
        "description": "Sesame paste noodles, Wuhan's signature breakfast"
      },
      {
        "name": "Wuchang Fish (武昌鱼)",
        "description": "Steamed fish with chili and fermented black beans"
      },
      {
        "name": "Doupi (豆皮)",
        "description": "Pan-fried bean skin with sticky rice and pork"
      },
      {
        "name": "Mian Wo (面窝)",
        "description": "Crispy fried dough with scallions"
      },
      {
        "name": "Jingwu Duck (精武鸭脖)",
        "description": "Spicy braised duck neck"
      }
    ],
    "street_food": [
      "Hot Dry Noodles",
      "Xiaolongbao",
      "Fried Dumplings",
      "Rice Wine"
    ],
    "famous_restaurants": [
      "Cai Lin Ji",
      "Lao Tong Cheng",
      "Xiao Tao Yuan"
    ]
  },
  "transportation": {
    "gettingThere": [
      "By Air: Wuhan Tianhe International Airport (WUH) with domestic and international flights",
      "By Train: Major railway hub with high-speed rail connections to all major cities",
      "By Bus: Long-distance bus services from neighboring provinces"
    ],
    "gettingAround": [
      "Metro: Modern subway system connecting major areas",
      "Bus: Comprehensive public bus network",
      "Taxi: Available for convenient travel",
      "Ferry: River ferries connecting different parts of the city"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Historic Sites",
      "activities": [
        "Morning: Visit Yellow Crane Tower for panoramic city views",
        "Afternoon: Explore the Yangtze River Bridge area",
        "Evening: Walk along the riverfront and enjoy local snacks"
      ]
    },
    {
      "day": "Day 2: Natural Beauty",
      "activities": [
        "Morning: Visit East Lake scenic area",
        "Afternoon: Explore Wuhan University campus (especially during cherry blossom season)",
        "Evening: Enjoy local cuisine at traditional restaurants"
      ]
    },
    {
      "day": "Day 3: Cultural Experience",
      "activities": [
        "Morning: Visit local museums and cultural sites",
        "Afternoon: Explore traditional neighborhoods and markets",
        "Evening: Experience Wuhan's night life and food culture"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/wuhan_1_optimized.jpg",
    "../images/user_photos/wuhan_2_optimized.jpg",
    "../images/user_photos/wuhan_3_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "WUHAN UNIVERSITY OF TECHNOLOGY"
    },
    {
      "number": "CN117111116A",
      "title": "High-speed rail track inspection system using laser scanning",
      "assignee": "CRRC WUHAN CO., LTD."
    },
    {
      "number": "CN116222227A",
      "title": "Optical fiber communication cable for undersea deployment",
      "assignee": "YANGTZE OPTICAL FIBRE AND CABLE CO., LTD."
    },
    {
      "number": "CN115333338A",
      "title": "Smart city flood prediction and early warning system",
      "assignee": "WUHAN UNIVERSITY"
    },
    {
      "number": "CN117444449A",
      "title": "Viral vaccine production method using cell culture technology",
      "assignee": "SINOPHARM WUHAN INSTITUTE OF BIOLOGICAL PRODUCTS CO., LTD."
    },
    {
      "number": "CN116555560A",
      "title": "Automotive engine emission control system",
      "assignee": "DONGFENG MOTOR CORPORATION"
    },
    {
      "number": "CN115666671A",
      "title": "Bridge structural health monitoring using IoT sensors",
      "assignee": "WUHAN UNIVERSITY OF TECHNOLOGY"
    },
    {
      "number": "CN117777782A",
      "title": "Thermal power plant flue gas desulfurization process",
      "assignee": "WUHAN KAIDI ELECTRIC POWER ENVIRONMENTAL CO., LTD."
    },
    {
      "number": "CN116888882A",
      "title": "Laser cutting machine for precision metal processing",
      "assignee": "WUHAN HGLASER ENGINEERING CO., LTD."
    },
    {
      "number": "CN115999993A",
      "title": "Underground metro tunnel boring shield machine",
      "assignee": "WUHAN HEAVY DUTY MACHINE TOOL GROUP CO., LTD."
    }
  ]
}