{
  "name": "Xiamen",
  "title": "Xiamen - Traveling China like your home yard",
  "heroTitle": "Xiamen",
  "heroSubtitle": "Coastal Garden City",
  "heroImage": "../images/user_photos/xiamen_hero_bg.jpg",
  "overview": "Xiamen, located on the southeast coast of China in Fujian Province, stands as one of the country's most livable and picturesque cities, earning its nickname 'Garden City' through abundant greenery, clean air, and careful urban planning. This port city of 5 million people faces Taiwan across the Taiwan Strait, a geographical position that has shaped its history as a trading hub and given it a cosmopolitan character rare in mainland China. Xiamen's unique charm lies in its successful preservation of natural beauty alongside modern development, creating an urban environment where residents and visitors can enjoy both contemporary amenities and traditional coastal tranquility. The crown jewel of Xiamen is undoubtedly Gulangyu Island, a car-free UNESCO World Heritage Site located just a five-minute ferry ride from the mainland. This pedestrian-only island of 2 square kilometers packs an extraordinary concentration of colonial-era architecture, with over 1,000 historical buildings representing various Western styles brought by foreign traders and missionaries who settled here in the 19th and early 20th centuries. The island's nickname 'Piano Island' reflects its unusual cultural heritage—despite its small size, Gulangyu produced an extraordinary number of classical musicians, and today it houses China's only piano museum. Wandering through its winding lanes, visitors discover hidden gardens, seaside villas, and cafes that evoke the atmosphere of a Mediterranean coastal town. On the mainland, Xiamen University regularly tops lists of China's most beautiful campuses, its traditional Fujian-style architecture set against hills and overlooking the sea. The nearby Nanputuo Temple, a thousand-year-old Buddhist monastery, attracts pilgrims and tourists with its striking architecture and vegetarian restaurant. Xiamen's cuisine reflects its coastal location, with fresh seafood dominating menus and local specialties like oyster omelets, satay noodles, and peanut soup delighting food lovers. The city's pleasant subtropical climate, with flowers blooming year-round, makes it an attractive destination in any season. Whether you're exploring colonial history on Gulangyu, enjoying fresh seafood by the waterfront, or simply soaking in the relaxed atmosphere of this coastal gem, Xiamen offers a refreshing alternative to the intensity of China's larger cities.",
  "highlights": {
    "attractions": "Gulangyu Island, Nanputuo Temple, Xiamen University, Huandao Road",
    "cuisine": "Seafood, Satay Noodles, Oyster Omelette, Spring Rolls",
    "bestTime": "Year-round destination, best in Spring and Autumn with mild weather"
  },
  "cuisine": {
    "dishes": [
      {
        "name": "Satay Noodles",
        "description": "Local specialty with noodles in rich satay soup, served with various toppings."
      },
      {
        "name": "Oyster Omelette",
        "description": "Popular street food with fresh oysters, eggs, and sweet potato starch."
      },
      {
        "name": "Xiamen Spring Rolls",
        "description": "Delicate spring rolls with various fillings, a traditional local snack."
      }
    ],
    "foodStreets": [
      {
        "name": "Zhongshan Road",
        "description": "Popular pedestrian street with local snacks and restaurants."
      },
      {
        "name": "Taiwan Snack Street",
        "description": "Food street with Taiwanese specialties and local cuisine."
      }
    ],
    "signature_dishes": [
      {
        "name": "Oyster Omelette (海蛎煎)",
        "description": "Crispy omelette with fresh oysters"
      },
      {
        "name": "Satay Noodles (沙茶面)",
        "description": "Noodles in spicy peanut satay sauce"
      },
      {
        "name": "Peanut Soup (花生汤)",
        "description": "Sweet creamy peanut soup"
      },
      {
        "name": "Fish Balls (鱼丸汤)",
        "description": "Handmade fish balls in clear soup"
      },
      {
        "name": "Spring Roll (春卷)",
        "description": "Crispy rolls with vegetable filling"
      }
    ],
    "street_food": [
      "Oyster Omelette",
      "Shacha Noodles",
      "Tusu Jelly",
      "Meat Wraps"
    ],
    "famous_restaurants": [
      "Wu Zai Tian",
      "Hao Qing Xiang",
      "Lao Xiamen"
    ],
    "food_icon": "https://kimi-web-img.moonshot.cn/img/thewoksoflife.com/31740f440a658cfba93fad42c441a669bd9cc815.jpg"
  },
  "transportation": {
    "gettingThere": [
      "By Air: Xiamen Gaoqi International Airport (XMN) with domestic and international flights",
      "By Train: High-speed rail connects Xiamen to major cities including Shanghai and Shenzhen",
      "By Bus: Long-distance bus services from neighboring provinces"
    ],
    "gettingAround": [
      "Bus: Comprehensive public bus system",
      "Taxi: Available for convenient travel",
      "Ferry: Regular ferry services to Gulangyu Island",
      "Bicycle: Popular for exploring Huandao Road and coastal areas"
    ]
  },
  "itinerary": [
    {
      "day": "Day 1: Island Exploration",
      "activities": [
        "Morning: Take ferry to Gulangyu Island and explore its historic architecture",
        "Afternoon: Visit Sunlight Rock for panoramic views",
        "Evening: Enjoy fresh seafood dinner on the island"
      ]
    },
    {
      "day": "Day 2: Culture and Scenery",
      "activities": [
        "Morning: Visit Nanputuo Temple and Xiamen University campus",
        "Afternoon: Cycle along Huandao Road and enjoy coastal views",
        "Evening: Explore Zhongshan Road pedestrian street"
      ]
    },
    {
      "day": "Day 3: Local Experience",
      "activities": [
        "Morning: Visit local markets and try traditional snacks",
        "Afternoon: Explore Jimei School Village and its unique architecture",
        "Evening: Experience Xiamen's night life and food culture"
      ]
    }
  ],
  "gallery": [
    "../images/user_photos/xiamen_gulangyu_optimized.jpg",
    "../images/user_photos/xiamen_university_optimized.jpg",
    "../images/user_photos/xiamen_hulishan_optimized.jpg"
  ],
  "patents": [
    {
      "number": "CN117309262A",
      "title": "Chip packaging structure and packaging method",
      "assignee": "XIAMEN UNIVERSITY"
    },
    {
      "number": "CN117111132A",
      "title": "Container terminal automation system",
      "assignee": "XIAMEN PORT HOLDING GROUP CO., LTD."
    },
    {
      "number": "CN116222243A",
      "title": "Gulangyu Island heritage preservation",
      "assignee": "XIAMEN CULTURAL HERITAGE PROTECTION CENTER"
    },
    {
      "number": "CN115333354A",
      "title": "Cross-strait logistics optimization platform",
      "assignee": "XIAMEN LOGISTICS GROUP CO., LTD."
    },
    {
      "number": "CN117444465A",
      "title": "LED lighting chip manufacturing",
      "assignee": "XIAMEN SANAN OPTOELECTRONICS CO., LTD."
    },
    {
      "number": "CN116555576A",
      "title": "Marine aquaculture smart monitoring",
      "assignee": "XIAMEN OCEAN UNIVERSITY"
    },
    {
      "number": "CN115666687A",
      "title": "Software park cloud computing infrastructure",
      "assignee": "XIAMEN SOFTWARE PARK"
    },
    {
      "number": "CN117777798A",
      "title": "Airport baggage handling automation",
      "assignee": "XIAMEN GAOGI INTERNATIONAL AIRPORT CO., LTD."
    },
    {
      "number": "CN116888896A",
      "title": "Undersea tunnel construction method",
      "assignee": "XIAMEN CONSTRUCTION GROUP CO., LTD."
    },
    {
      "number": "CN116000007A",
      "title": "Bicycle sharing system with solar charging",
      "assignee": "XIAMEN UNIVERSITY"
    }
  ]
}